doc/postmodern.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-01-21 Fri 15:02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Postmodern Reference Manual</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sabra Crolleton">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Postmodern Reference Manual</h1>
</header><nav id="table-of-contents">
