doc/postmodern.org
* Connecting
:PROPERTIES:
:CUSTOM_ID: connecting
:END:
** class database-connection
:PROPERTIES:
:ID:       821e500c-5206-4f8b-a505-266d18faf8cb
:CUSTOM_ID: class-database-connection
:END:

Representation of a database connection. Contains login information in order to
be able to automatically re-establish a connection when it is somehow closed.

** function connect (database user-name password host &key (port 5432) pooled-p use-ssl service application-name use-binary)
:PROPERTIES:
:CUSTOM_ID: function-connection
:END:
→ database-connection

Create a new database connection for the given user and the database. Port will
default to 5432, which is where most PostgreSQL servers are running. If
pooled-p is T, a connection will be taken from a pool of connections of this
type, if one is available there, and when the connection is disconnected it will
be put back into this pool instead. use-ssl can be :no, :try, :require, :yes, or :full
and defaults to the value of =*default-use-ssl*=

- :try means if the server supports it
- :require means use provided ssl certificate with no verification
- :yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname
- :full means expect a CA-signed cert for the supplied hostname and verify the server hostname
If you set it to anything other than :no be sure to also load the CL+SSL library.

Service defaults to "postgres".

Application-name defaults to a blank string. If provided, Postgresl can use it to track applications with multiple connections.

Use-binary defaults to nil. If set to T, then Postmodern will pass integer, float, double-float (except clisp) and boolean parameters to Postgresql in binary rather than text.

The following example connects to a database named test-db running on a server at the ip
address 192.168.5.223 with the non-standard port 5434 using a pooled connection, trying to use ssh if the server accepts that and falling back to an unencrypted connection if not, with an application name of "test-app".
#+begin_src lisp
  (connect "test_db" "test-user" "test-password" "192.168.5.223"
           :port 5434 :pooled-p t :use-ssl :try :application-name "test-app" :use-binary t)
#+end_src
Postmodern as of version 1.33.0 provides the ability to pass parameters to Postgresql in binary format IF that format is available for that datatype. Currently this means int2, int4, int8, float, double-float (except clisp) and boolean. Rational numbers continue to be passed as text.

The flag is set in the database connection object. This means it can be set either in the initial connection to the database  with =:use-binary t= as noted above or using the =(use-binary-parameters t)= function to set it after the initial connection has been established. If you are using multiple connections, some can be set to use binary parameters, some not.

If a query to Postgresql does not have a table column which would allow Postgresql to determine the correct datatype and you do not specify differently, Postgresql will treat the parameters passed with the query as text. The default text setting with results:
#+begin_src lisp
  (query "select $1" 1 :single)
  "1"
  (query "select $1" 1.5 :single)
  "1.5"
  (query "select $1" T :single)
  "true"
  (query "select $1" nil :single)
  "false"
  (query "select $1" :NULL :single)
  :NULL
#+end_src
You can specify parameter type as so:
#+begin_src lisp
  (query "select $1::integer" 1 :single)
  1
#+end_src
Setting the use-binary slot in the database connection object to t has the following results:
#+begin_src lisp
  (query "select $1" 1 :single)
  1
  (query "select $1" 1.5 :single)
  1.5
  (query "select $1" T :single)
  T
  (query "select $1" nil :single)
  NIL
  (query "select $1" :NULL :single)
  :NULL
#+end_src
The default for Postmodern is to continue to pass parameters to Postgresql as text (not in binary format) in order to avoid breaking existing user code. If you want to pass parameters to Postgresql in binary format and want to set that up when you are making the database connection, the following examples may help. We continue the difference in the signatures (cl-postgres uses optional parameters and postmodern uses keyword parameters) because of the expected downstream breakage if we shifted cl-postgres:open-database to using keyword parameters.

In postmodern you have the connect function or you can use the with-connection macro:
#+begin_src lisp
  (defmacro with-connection (spec &body body)
    `(let ((*database* (apply #'connect ,spec)))
       (unwind-protect (progn ,@body)
         (disconnect *database*))))
#+end_src
So often you would connect something like this:
#+begin_src lisp
  (with-connection '("database_name" "user-name" "user-password" "localhost or IP address"
                     :use-binary t)
    ...)
#+end_src

You can also change the flag after the connection is established with the =use-binary-parameters= function, passing T to use binary parameters or nil to use text parameters:
#+begin_src lisp
  (use-binary-parameters *database* t)
#+end_src
Using binary parameters does tighten type checking when using prepared queries. You will not be able to use prepared queries with varying formats. In other words, if you have a prepared query that you pass an integer as the first parameter and a string as the second parameter the first time it is used, any subsequent uses of that prepared query during that session will also have to pass an integer as the first parameter and a string as the second parameter.

Benchmarking does indicate a slight speed and consing benefit to passing parameters as binary, but your mileage will vary depending on your use case.

** variable =*default-use-ssl*=
:PROPERTIES:
:CUSTOM_ID: variable-default-use-ssl
:END:

The default for connect's use-ssl argument.
Valid settings are :no, :try, :require, :yes, or :full

:try means if the server supports it

:require means use provided ssl certificate with no verification

:yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname

:full means expect a CA-signed cert for the supplied hostname and verify the server hostname

If you set it to anything other than :no be sure to also load the CL+SSL library.

