doc/postmodern.html

<div id="outline-container-connecting" class="outline-2">
<h2 id="connecting">Connecting</h2>
<div class="outline-text-2" id="text-connecting">
</div>
<div id="outline-container-class-database-connection" class="outline-3">
<h3 id="class-database-connection">class database-connection</h3>
<div class="outline-text-3" id="text-class-database-connection">
<p>
Representation of a database connection. Contains login information in order to
be able to automatically re-establish a connection when it is somehow closed.
</p>
</div>
</div>

<div id="outline-container-function-connection" class="outline-3">
<h3 id="function-connection">function connect (database user-name password host &amp;key (port 5432) pooled-p use-ssl service application-name use-binary)</h3>
<div class="outline-text-3" id="text-function-connection">
<p>
→ database-connection
</p>

<p>
Create a new database connection for the given user and the database. Port will
default to 5432, which is where most PostgreSQL servers are running. If
pooled-p is T, a connection will be taken from a pool of connections of this
type, if one is available there, and when the connection is disconnected it will
be put back into this pool instead. use-ssl can be :no, :try, :require, :yes, or :full
and defaults to the value of <code>*default-use-ssl*</code>
</p>

<ul class="org-ul">
<li>:try means if the server supports it</li>
<li>:require means use provided ssl certificate with no verification</li>
<li>:yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname</li>
<li>:full means expect a CA-signed cert for the supplied hostname and verify the server hostname</li>
</ul>
<p>
If you set it to anything other than :no be sure to also load the CL+SSL library.
</p>

<p>
Service defaults to "postgres".
</p>

<p>
Application-name defaults to a blank string. If provided, Postgresl can use it to track applications with multiple connections.
</p>

<p>
Use-binary defaults to nil. If set to T, then Postmodern will pass integer, float, double-float (except clisp) and boolean parameters to Postgresql in binary rather than text.
</p>

<p>
The following example connects to a database named test-db running on a server at the ip
address 192.168.5.223 with the non-standard port 5434 using a pooled connection, trying to use ssh if the server accepts that and falling back to an unencrypted connection if not, with an application name of "test-app".
</p>
<div class="org-src-container">
<pre class="src src-lisp">(connect <span style="color: #e67128;">"test_db"</span> <span style="color: #e67128;">"test-user"</span> <span style="color: #e67128;">"test-password"</span> <span style="color: #e67128;">"192.168.5.223"</span>
         <span style="color: #23d7d7;">:port</span> 5434 <span style="color: #23d7d7;">:pooled-p</span> t <span style="color: #23d7d7;">:use-ssl</span> <span style="color: #23d7d7;">:try</span> <span style="color: #23d7d7;">:application-name</span> <span style="color: #e67128;">"test-app"</span> <span style="color: #23d7d7;">:use-binary</span> t)
</pre>
</div>
<p>
Postmodern as of version 1.33.0 provides the ability to pass parameters to Postgresql in binary format IF that format is available for that datatype. Currently this means int2, int4, int8, float, double-float (except clisp) and boolean. Rational numbers continue to be passed as text.
</p>

<p>
The flag is set in the database connection object. This means it can be set either in the initial connection to the database  with <code>:use-binary t</code> as noted above or using the <code>(use-binary-parameters t)</code> function to set it after the initial connection has been established. If you are using multiple connections, some can be set to use binary parameters, some not.
</p>

<p>
If a query to Postgresql does not have a table column which would allow Postgresql to determine the correct datatype and you do not specify differently, Postgresql will treat the parameters passed with the query as text. The default text setting with results:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1"</span> 1 <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"1"</span>
(query <span style="color: #e67128;">"select $1"</span> 1.5 <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"1.5"</span>
(query <span style="color: #e67128;">"select $1"</span> T <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"true"</span>
(query <span style="color: #e67128;">"select $1"</span> nil <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"false"</span>
(query <span style="color: #e67128;">"select $1"</span> <span style="color: #23d7d7;">:NULL</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #23d7d7;">:NULL</span>
</pre>
</div>
<p>
You can specify parameter type as so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1::integer"</span> 1 <span style="color: #23d7d7;">:single</span>)
1
</pre>
</div>
<p>
Setting the use-binary slot in the database connection object to t has the following results:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select $1"</span> 1 <span style="color: #23d7d7;">:single</span>)
1
(query <span style="color: #e67128;">"select $1"</span> 1.5 <span style="color: #23d7d7;">:single</span>)
1.5
(query <span style="color: #e67128;">"select $1"</span> T <span style="color: #23d7d7;">:single</span>)
T
(query <span style="color: #e67128;">"select $1"</span> nil <span style="color: #23d7d7;">:single</span>)
NIL
(query <span style="color: #e67128;">"select $1"</span> <span style="color: #23d7d7;">:NULL</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #23d7d7;">:NULL</span>
</pre>
</div>
<p>
The default for Postmodern is to continue to pass parameters to Postgresql as text (not in binary format) in order to avoid breaking existing user code. If you want to pass parameters to Postgresql in binary format and want to set that up when you are making the database connection, the following examples may help. We continue the difference in the signatures (cl-postgres uses optional parameters and postmodern uses keyword parameters) because of the expected downstream breakage if we shifted cl-postgres:open-database to using keyword parameters.
</p>

<p>
In postmodern you have the connect function or you can use the with-connection macro:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defmacro</span> <span style="color: #00ede1; font-weight: bold;">with-connection</span> (spec <span style="color: #34cae2;">&amp;body</span> body)
  `(<span style="color: #ffad29; font-weight: bold;">let</span> ((*database* (apply #'connect ,spec)))
     (<span style="color: #ffad29; font-weight: bold;">unwind-protect</span> (<span style="color: #ffad29; font-weight: bold;">progn</span> ,@body)
       (disconnect *database*))))
</pre>
</div>
<p>
So often you would connect something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"database_name"</span> <span style="color: #e67128;">"user-name"</span> <span style="color: #e67128;">"user-password"</span> <span style="color: #e67128;">"localhost or IP address"</span>
                   <span style="color: #23d7d7;">:use-binary</span> t)
  ...)
</pre>
</div>

<p>
You can also change the flag after the connection is established with the <code>use-binary-parameters</code> function, passing T to use binary parameters or nil to use text parameters:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(use-binary-parameters *database* t)
</pre>
</div>
<p>
Using binary parameters does tighten type checking when using prepared queries. You will not be able to use prepared queries with varying formats. In other words, if you have a prepared query that you pass an integer as the first parameter and a string as the second parameter the first time it is used, any subsequent uses of that prepared query during that session will also have to pass an integer as the first parameter and a string as the second parameter.
</p>

<p>
Benchmarking does indicate a slight speed and consing benefit to passing parameters as binary, but your mileage will vary depending on your use case.
</p>
</div>
</div>

<div id="outline-container-variable-default-use-ssl" class="outline-3">
<h3 id="variable-default-use-ssl">variable <code>*default-use-ssl*</code></h3>
<div class="outline-text-3" id="text-variable-default-use-ssl">
<p>
The default for connect's use-ssl argument.
Valid settings are :no, :try, :require, :yes, or :full
</p>

<p>
:try means if the server supports it
</p>

<p>
:require means use provided ssl certificate with no verification
</p>

<p>
:yes means verify that the server cert is issued by a trusted CA, but does not verify the server hostname
</p>

<p>
:full means expect a CA-signed cert for the supplied hostname and verify the server hostname
</p>

<p>
If you set it to anything other than :no be sure to also load the CL+SSL library.
</p>
</div>
</div>
