doc/postmodern.org
** method disconnect (database-connection)
:PROPERTIES:
:CUSTOM_ID: method-disconnect
:END:

Disconnects a normal database connection, or moves a pooled connection into the
pool.

** function connected-p (database-connection)
:PROPERTIES:
:CUSTOM_ID: function-connected-p
:END:
→ boolean

Returns a boolean indicating whether the given connection is still connected to
the server.

** method reconnect (database-connection)
:PROPERTIES:
:CUSTOM_ID: method-reconnect
:END:

Reconnect a disconnected database connection. This is not allowed for pooled
connections ― after they are disconnected they might be in use by some other
process, and should no longer be used.

** variable =*database*=
:PROPERTIES:
:CUSTOM_ID: variable-database
:END:

Special variable holding the current database connection information. Most
functions and macros operating on a database assume this binds to a connected
database.

** macro with-connection (spec &body body)
:PROPERTIES:
:CUSTOM_ID: macro-with-connection
:END:

Evaluates the body with =*database*= bound to a connection as specified by spec,
which should be list that connect can be applied to.

Examples:
#+begin_src lisp
  (with-connection '("test_database" "sabra" "some_strange_password_here" "localhost")
    (list-tables))

  (with-connection '("test_db" "test-user" "test-password" "192.168.5.223"
                     :port 5434 :pooled-p t :use-ssl try :application-name "test-app")
    (list-tables))

  (with-connection '("test_db" "test-user" "test-password" "192.168.5.223"
                     :port 5434 :pooled-p t :use-ssl try :application-name "test-app"
                     :use-binary t)
    (list-tables))
#+end_src

** macro call-with-connection (spec thunk)
:PROPERTIES:
:CUSTOM_ID: macro-call-with-connection
:END:

The functional backend to with-connection. Binds =*database*= to a new connection
as specified by spec, which should be a list that connect can be applied to, and
runs the zero-argument function given as second argument in the new environment.
When the function returns or throws, the new connection is disconnected.

** function connect-toplevel (database user-name password host &key (port 5432) (use-ssl *default-use-ssl*) (application-name "") use-binary)
:PROPERTIES:
:CUSTOM_ID: function-connect-toplevel
:END:

Bind the =*database*= to a new connection. Use this if you only need one
long running connection. For example, you want a connection for debugging from the REPL.
It will still allow you to use with-connection to create a separate shorter-term
connection if you want.

** function disconnect-toplevel ()
:PROPERTIES:
:CUSTOM_ID: function-disconnect-toplevel
:END:

Disconnect the =*database*=.

** function clear-connection-pool ()
:PROPERTIES:
:CUSTOM_ID: function-clear-connection-pool
:END:

Disconnect and remove all connections from the connection pools.

** variable =*max-pool-size*=
:PROPERTIES:
:CUSTOM_ID: variable-max-pool-size
:END:

Set the maximum amount of connections kept in a single connection pool, where a
pool consists of all the stored connections with the exact same connect
arguments. Defaults to NIL, which means there is no maximum.

** function list-connections ()
:PROPERTIES:
:CUSTOM_ID: function-list-connections
:END:
→ list

List the current postgresql connections to the currently connected database. It
does this by returning info from pg_stat_activity on open connections.

** function use-binary-parameters (database-connection param)
:PROPERTIES:
:CUSTOM_ID: function-use-binary-parameters
:END:

You can set the flag for Postmodern to pass parameters in binary form to Postgresql after the connection is established with the use-binary-parameters function. You need to provide the database connection object and then either t (to use binary parameters) or nil (to pass parameters as text).

    (pomo:use-binary-parameters *database* t)

* Querying
:PROPERTIES:
:CUSTOM_ID: querying
:END:
For queries involving dao-classes, see [[file:dao-classes.html#query-and-selection][Dao Query and Selection]]
