doc/postmodern.html

<div id="outline-container-method-disconnect" class="outline-3">
<h3 id="method-disconnect">method disconnect (database-connection)</h3>
<div class="outline-text-3" id="text-method-disconnect">
<p>
Disconnects a normal database connection, or moves a pooled connection into the
pool.
</p>
</div>
</div>

<div id="outline-container-function-connected-p" class="outline-3">
<h3 id="function-connected-p">function connected-p (database-connection)</h3>
<div class="outline-text-3" id="text-function-connected-p">
<p>
→ boolean
</p>

<p>
Returns a boolean indicating whether the given connection is still connected to
the server.
</p>
</div>
</div>

<div id="outline-container-method-reconnect" class="outline-3">
<h3 id="method-reconnect">method reconnect (database-connection)</h3>
<div class="outline-text-3" id="text-method-reconnect">
<p>
Reconnect a disconnected database connection. This is not allowed for pooled
connections ― after they are disconnected they might be in use by some other
process, and should no longer be used.
</p>
</div>
</div>

<div id="outline-container-variable-database" class="outline-3">
<h3 id="variable-database">variable <code>*database*</code></h3>
<div class="outline-text-3" id="text-variable-database">
<p>
Special variable holding the current database connection information. Most
functions and macros operating on a database assume this binds to a connected
database.
</p>
</div>
</div>

<div id="outline-container-macro-with-connection" class="outline-3">
<h3 id="macro-with-connection">macro with-connection (spec &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-with-connection">
<p>
Evaluates the body with <code>*database*</code> bound to a connection as specified by spec,
which should be list that connect can be applied to.
</p>

<p>
Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"test_database"</span> <span style="color: #e67128;">"sabra"</span> <span style="color: #e67128;">"some_strange_password_here"</span> <span style="color: #e67128;">"localhost"</span>)
  (list-tables))

(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"test_db"</span> <span style="color: #e67128;">"test-user"</span> <span style="color: #e67128;">"test-password"</span> <span style="color: #e67128;">"192.168.5.223"</span>
                   <span style="color: #23d7d7;">:port</span> 5434 <span style="color: #23d7d7;">:pooled-p</span> t <span style="color: #23d7d7;">:use-ssl</span> try <span style="color: #23d7d7;">:application-name</span> <span style="color: #e67128;">"test-app"</span>)
  (list-tables))

(<span style="color: #ffad29; font-weight: bold;">with-connection</span> '(<span style="color: #e67128;">"test_db"</span> <span style="color: #e67128;">"test-user"</span> <span style="color: #e67128;">"test-password"</span> <span style="color: #e67128;">"192.168.5.223"</span>
                   <span style="color: #23d7d7;">:port</span> 5434 <span style="color: #23d7d7;">:pooled-p</span> t <span style="color: #23d7d7;">:use-ssl</span> try <span style="color: #23d7d7;">:application-name</span> <span style="color: #e67128;">"test-app"</span>
                   <span style="color: #23d7d7;">:use-binary</span> t)
  (list-tables))
</pre>
</div>
</div>
</div>

<div id="outline-container-macro-call-with-connection" class="outline-3">
<h3 id="macro-call-with-connection">macro call-with-connection (spec thunk)</h3>
<div class="outline-text-3" id="text-macro-call-with-connection">
<p>
The functional backend to with-connection. Binds <code>*database*</code> to a new connection
as specified by spec, which should be a list that connect can be applied to, and
runs the zero-argument function given as second argument in the new environment.
When the function returns or throws, the new connection is disconnected.
</p>
</div>
</div>

<div id="outline-container-function-connect-toplevel" class="outline-3">
<h3 id="function-connect-toplevel">function connect-toplevel (database user-name password host &amp;key (port 5432) (use-ssl <b>default-use-ssl</b>) (application-name "") use-binary)</h3>
<div class="outline-text-3" id="text-function-connect-toplevel">
<p>
Bind the <code>*database*</code> to a new connection. Use this if you only need one
long running connection. For example, you want a connection for debugging from the REPL.
It will still allow you to use with-connection to create a separate shorter-term
connection if you want.
</p>
</div>
</div>

<div id="outline-container-function-disconnect-toplevel" class="outline-3">
<h3 id="function-disconnect-toplevel">function disconnect-toplevel ()</h3>
<div class="outline-text-3" id="text-function-disconnect-toplevel">
<p>
Disconnect the <code>*database*</code>.
</p>
</div>
</div>

<div id="outline-container-function-clear-connection-pool" class="outline-3">
<h3 id="function-clear-connection-pool">function clear-connection-pool ()</h3>
<div class="outline-text-3" id="text-function-clear-connection-pool">
<p>
Disconnect and remove all connections from the connection pools.
</p>
</div>
</div>

<div id="outline-container-variable-max-pool-size" class="outline-3">
<h3 id="variable-max-pool-size">variable <code>*max-pool-size*</code></h3>
<div class="outline-text-3" id="text-variable-max-pool-size">
<p>
Set the maximum amount of connections kept in a single connection pool, where a
pool consists of all the stored connections with the exact same connect
arguments. Defaults to NIL, which means there is no maximum.
</p>
</div>
</div>

<div id="outline-container-function-list-connections" class="outline-3">
<h3 id="function-list-connections">function list-connections ()</h3>
<div class="outline-text-3" id="text-function-list-connections">
<p>
→ list
</p>

<p>
List the current postgresql connections to the currently connected database. It
does this by returning info from pg_stat_activity on open connections.
</p>
</div>
</div>

<div id="outline-container-function-use-binary-parameters" class="outline-3">
<h3 id="function-use-binary-parameters">function use-binary-parameters (database-connection param)</h3>
<div class="outline-text-3" id="text-function-use-binary-parameters">
<p>
You can set the flag for Postmodern to pass parameters in binary form to Postgresql after the connection is established with the use-binary-parameters function. You need to provide the database connection object and then either t (to use binary parameters) or nil (to pass parameters as text).
</p>

<p>
(pomo:use-binary-parameters <b>database</b> t)
</p>
</div>
</div>
</div>

<div id="outline-container-querying" class="outline-2">
<h2 id="querying">Querying</h2>
<div class="outline-text-2" id="text-querying">
<p>
For queries involving dao-classes, see <a href="dao-classes.html#query-and-selection">Dao Query and Selection</a>
</p>
</div>
