doc/postmodern.org
** macro query (query &rest args/format)
:PROPERTIES:
:CUSTOM_ID: macro-query
:END:
→ result

Execute the given query, which can be either a string or an S-SQL form
(list starting with a keyword). If the query contains placeholders ($1, $2, etc)
their values can be given as extra arguments. If one of these arguments
is a keyword occurring in the table below, it will not be used as a query
argument, but will determine the format in which the results are returned
instead. Any of the following formats can be used, with the default being :rows:

| :none	             | Ignore the result values.                                                                                                                                |
| :lists, :rows       | 	Return a list of lists, each list containing the values for a row.                                                                                     |
| :list, :row         | 	Return a single row as a list.                                                                                                                         |
| :alists	           | Return a list of alists which map column names to values, with the names represented as keywords.                                                        |
| :alist	            | Return a single row as an alist.                                                                                                                         |
| :str-alists         | 	Like :alists, but use the original column names.                                                                                                       |
| :str-alist	        | Return a single row as an alist, with strings for names.                                                                                                 |
| :plists	           | Return a list of plists which map column names to values,with the names represented as keywords.                                                         |
| :plist	            | Return a single row as a plist.                                                          |
| :column	           | Return a single column as a list.                 |
| :single	           | Return a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row. |
| :single!	          | Like :single except that it will throw an error when the number of selected rows is not equal to 1.  |
| :vectors	    | Return a vector of vectors, each vector containing the values for a row. (This is only the plural) |
| :array-hash         | Return an array of hashtables which map column names to hash table keys     |
| :json-strs          | Return a list of strings where each row is a json object expressed as a string  |
| :json-str           | Return a single string where the row returned is a json object expressed as a string           |
| :json-array-str     | Return a string containing a json array, each element in the array is a selected row expressed as a json object |
| (:dao type)	       | Return a list of DAOs of the given type. The names of the fields returned by the query must match slots in the DAO class the same way as with query-dao. |
| (:dao type :single) | 	Return a single DAO of the given type. |

Some Examples:
*** Default
:PROPERTIES:
:CUSTOM_ID: default
:END:
The default is :lists
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)))
  ((1 2147483645 "text one") (2 0 "text two"))
#+END_SRC
*** Single
:PROPERTIES:
:CUSTOM_ID: single
:END:
Returns a single field. Will throw an error if the queries returns more than one field or more than one row
#+BEGIN_SRC lisp
  (query (:select 'text :from 'short-data-type-tests :where (:= 'id 3)) :single)
  "text three"
#+END_SRC
*** List
:PROPERTIES:
:CUSTOM_ID: list
:END:
Returns a list containing the selected fields. Will throw an error if the query returns more than one row
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:= 'id 3)) :list)
  (3 3 "text three")
#+END_SRC
*** Lists
:PROPERTIES:
:CUSTOM_ID: lists
:END:
This is the default
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :lists)
  ((1 2147483645 "text one") (2 0 "text two"))
#+END_SRC
*** Alist
:PROPERTIES:
:CUSTOM_ID: alist
:END:
Returns an alist containing the field name as a keyword and the selected fields. Will throw an error if the query returns more than one row.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'test-data :where (:= 'id 3)) :alist)
  ((:ID . 3) (:INT4 . 3) (:TEXT . "text three"))
#+END_SRC
*** Str-alist
:PROPERTIES:
:CUSTOM_ID: str-alist
:END:
Returns an alist containing the field name as a lower case string and the selected fields. Will throw an error if the query returns more than one row.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:= 'id 3)) :str-alist)
  (("id" . 3) ("int4" . 3) ("text" . "text three"))
#+END_SRC
*** Alists
:PROPERTIES:
:CUSTOM_ID: alists
:END:
Returns a list of alists containing the field name as a keyword and the selected fields.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :alists)
  (((:ID . 1) (:INT4 . 2147483645) (:TEXT . "text one"))
   ((:ID . 2) (:INT4 . 0) (:TEXT . "text two")))
#+END_SRC
*** Str-alists
:PROPERTIES:
:CUSTOM_ID: str-alists
:END:
Returns a list of alists containing the field name as a lower case string and the selected fields.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :str-alists)
  ((("id" . 1) ("int4" . 2147483645) ("text" . "text one"))
   (("id" . 2) ("int4" . 0) ("text" . "text two")))
#+END_SRC
