doc/postmodern.html
<div id="outline-container-macro-query" class="outline-3">
<h3 id="macro-query">macro query (query &amp;rest args/format)</h3>
<div class="outline-text-3" id="text-macro-query">
<p>
→ result
</p>

<p>
Execute the given query, which can be either a string or an S-SQL form
(list starting with a keyword). If the query contains placeholders ($1, $2, etc)
their values can be given as extra arguments. If one of these arguments
is a keyword occurring in the table below, it will not be used as a query
argument, but will determine the format in which the results are returned
instead. Any of the following formats can be used, with the default being :rows:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">:none</td>
<td class="org-left">Ignore the result values.</td>
</tr>

<tr>
<td class="org-left">:lists, :rows</td>
<td class="org-left">Return a list of lists, each list containing the values for a row.</td>
</tr>

<tr>
<td class="org-left">:list, :row</td>
<td class="org-left">Return a single row as a list.</td>
</tr>

<tr>
<td class="org-left">:alists</td>
<td class="org-left">Return a list of alists which map column names to values, with the names represented as keywords.</td>
</tr>

<tr>
<td class="org-left">:alist</td>
<td class="org-left">Return a single row as an alist.</td>
</tr>

<tr>
<td class="org-left">:str-alists</td>
<td class="org-left">Like :alists, but use the original column names.</td>
</tr>

<tr>
<td class="org-left">:str-alist</td>
<td class="org-left">Return a single row as an alist, with strings for names.</td>
</tr>

<tr>
<td class="org-left">:plists</td>
<td class="org-left">Return a list of plists which map column names to values,with the names represented as keywords.</td>
</tr>

<tr>
<td class="org-left">:plist</td>
<td class="org-left">Return a single row as a plist.</td>
</tr>

<tr>
<td class="org-left">:column</td>
<td class="org-left">Return a single column as a list.</td>
</tr>

<tr>
<td class="org-left">:single</td>
<td class="org-left">Return a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row.</td>
</tr>

<tr>
<td class="org-left">:single!</td>
<td class="org-left">Like :single except that it will throw an error when the number of selected rows is not equal to 1.</td>
</tr>

<tr>
<td class="org-left">:vectors</td>
<td class="org-left">Return a vector of vectors, each vector containing the values for a row. (This is only the plural)</td>
</tr>

<tr>
<td class="org-left">:array-hash</td>
<td class="org-left">Return an array of hashtables which map column names to hash table keys</td>
</tr>

<tr>
<td class="org-left">:json-strs</td>
<td class="org-left">Return a list of strings where each row is a json object expressed as a string</td>
</tr>

<tr>
<td class="org-left">:json-str</td>
<td class="org-left">Return a single string where the row returned is a json object expressed as a string</td>
</tr>

<tr>
<td class="org-left">:json-array-str</td>
<td class="org-left">Return a string containing a json array, each element in the array is a selected row expressed as a json object</td>
</tr>

<tr>
<td class="org-left">(:dao type)</td>
<td class="org-left">Return a list of DAOs of the given type. The names of the fields returned by the query must match slots in the DAO class the same way as with query-dao.</td>
</tr>

<tr>
<td class="org-left">(:dao type :single)</td>
<td class="org-left">Return a single DAO of the given type.</td>
</tr>
</tbody>
</table>

<p>
Some Examples:
</p>
</div>
<div id="outline-container-default" class="outline-4">
<h4 id="default">Default</h4>
<div class="outline-text-4" id="text-default">
<p>
The default is :lists
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)))
((1 2147483645 <span style="color: #e67128;">"text one"</span>) (2 0 <span style="color: #e67128;">"text two"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-single" class="outline-4">
<h4 id="single">Single</h4>
<div class="outline-text-4" id="text-single">
<p>
Returns a single field. Will throw an error if the queries returns more than one field or more than one row
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"text three"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-list" class="outline-4">
<h4 id="list">List</h4>
<div class="outline-text-4" id="text-list">
<p>
Returns a list containing the selected fields. Will throw an error if the query returns more than one row
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:list</span>)
(3 3 <span style="color: #e67128;">"text three"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-lists" class="outline-4">
<h4 id="lists">Lists</h4>
<div class="outline-text-4" id="text-lists">
<p>
This is the default
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:lists</span>)
((1 2147483645 <span style="color: #e67128;">"text one"</span>) (2 0 <span style="color: #e67128;">"text two"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-alist" class="outline-4">
<h4 id="alist">Alist</h4>
<div class="outline-text-4" id="text-alist">
<p>
Returns an alist containing the field name as a keyword and the selected fields. Will throw an error if the query returns more than one row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'test-data <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:alist</span>)
((<span style="color: #23d7d7;">:ID</span> . 3) (<span style="color: #23d7d7;">:INT4</span> . 3) (<span style="color: #23d7d7;">:TEXT</span> . <span style="color: #e67128;">"text three"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-str-alist" class="outline-4">
<h4 id="str-alist">Str-alist</h4>
<div class="outline-text-4" id="text-str-alist">
<p>
Returns an alist containing the field name as a lower case string and the selected fields. Will throw an error if the query returns more than one row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:str-alist</span>)
((<span style="color: #e67128;">"id"</span> . 3) (<span style="color: #e67128;">"int4"</span> . 3) (<span style="color: #e67128;">"text"</span> . <span style="color: #e67128;">"text three"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-alists" class="outline-4">
<h4 id="alists">Alists</h4>
<div class="outline-text-4" id="text-alists">
<p>
Returns a list of alists containing the field name as a keyword and the selected fields.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:alists</span>)
(((<span style="color: #23d7d7;">:ID</span> . 1) (<span style="color: #23d7d7;">:INT4</span> . 2147483645) (<span style="color: #23d7d7;">:TEXT</span> . <span style="color: #e67128;">"text one"</span>))
 ((<span style="color: #23d7d7;">:ID</span> . 2) (<span style="color: #23d7d7;">:INT4</span> . 0) (<span style="color: #23d7d7;">:TEXT</span> . <span style="color: #e67128;">"text two"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-str-alists" class="outline-4">
<h4 id="str-alists">Str-alists</h4>
<div class="outline-text-4" id="text-str-alists">
<p>
Returns a list of alists containing the field name as a lower case string and the selected fields.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:str-alists</span>)
(((<span style="color: #e67128;">"id"</span> . 1) (<span style="color: #e67128;">"int4"</span> . 2147483645) (<span style="color: #e67128;">"text"</span> . <span style="color: #e67128;">"text one"</span>))
 ((<span style="color: #e67128;">"id"</span> . 2) (<span style="color: #e67128;">"int4"</span> . 0) (<span style="color: #e67128;">"text"</span> . <span style="color: #e67128;">"text two"</span>)))
</pre>
</div>
</div>
</div>
