doc/postmodern.org
*** Plist
:PROPERTIES:
:CUSTOM_ID: plist
:END:
Returns a plist containing the field name as a keyword and the selected fields. Will throw an error if the query returns more than one row.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:= 'id 3)) :plist)
  (:ID 3 :INT4 3 :TEXT "text three")
#+END_SRC
*** Plists
:PROPERTIES:
:CUSTOM_ID: plists
:END:
Returns a list of plists containing the field name as a keyword and the selected fields.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :plists)
  ((:ID 1 :INT4 2147483645 :TEXT "text one") (:ID 2 :INT4 0 :TEXT "text two"))
#+END_SRC
*** Vectors
:PROPERTIES:
:CUSTOM_ID: vectors
:END:
Returns a vector of vectors where each internal vector is a returned row from the query. The field names are not included. NOTE: It will return an empty vector instead of NIL if there is no result.
#+begin_src lisp
  (query (:select 'id 'int4 'text :from 'test-data)
         :vectors)
  #(#(1 2147483645 "text one")
    #(2 0 "text two")
    #(3 3 "text three"))

  (query (:select 'id 'int4 'text :from 'test-data :where (:< 'id 1))
         :vectors)
  #()
#+end_src
*** Array-hash
:PROPERTIES:
:CUSTOM_ID: array-hash
:END:
Returns a vector of hashtables where each hash table is a returned row from the query with field name as the key expressed as a lower case string.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :array-hash)
  #(#<HASH-TABLE :TEST EQUAL :COUNT 3 {100D982B53}>
    #<HASH-TABLE :TEST EQUAL :COUNT 3 {100D982ED3}>)

  (alexandria:hash-table-alist
   (aref
    (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :array-hash)
    1))
  (("text" . "text two") ("int4" . 0) ("id" . 2))
#+END_SRC
*** Dao
:PROPERTIES:
:CUSTOM_ID: dao-results
:END:
Returns a list of daos of the type specified
#+BEGIN_SRC lisp
  (query (:select '* :from 'country) (:dao country))
  (#<COUNTRY {1010464023}> #<COUNTRY {1010465CB3}>)

  (query (:select '* :from 'country :where (:= 'name "Croatia")) (:dao country))
  (#<COUNTRY {1010688943}>)
#+END_SRC
*** Column
:PROPERTIES:
:CUSTOM_ID: column-results
:END:
Returns a list of field values of a single field. Will throw an error if more than one field is selected
#+BEGIN_SRC lisp
  (query (:select 'id :from 'short-data-type-tests :where (:< 'id 3)) :column)
  (1 2)

  (query (:select 'id :from 'short-data-type-tests :where (:= 'id 3)) :column)
  (3)
#+END_SRC
*** Json-strs
:PROPERTIES:
:CUSTOM_ID: json-strs
:END:
Return a list of strings where the row returned is a json object expressed as a string
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :json-strs)
  ("{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}"
   "{\"id\":2,\"int4\":0,\"text\":\"text two\"}")
#+END_SRC
This will also handle local-time timestamps and simple-date timestamps,
time-of-day and date. E.g. (with a local-time timestamp)
#+BEGIN_SRC lisp
  (query (:select 'timestamp-with-time-zone
          :from 'test-data
          :where (:< 'id 3))
         :json-strs)

  '("{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"
    "{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}")
#+END_SRC

The following is an example with a simple-date timestamp.
#+BEGIN_SRC lisp
  (query (:select 'timestamp-with-time-zone
          :from 'test-data
          :where (:< 'id 3)) :json-strs)
  '("{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"
    "{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}")
#+END_SRC
*** Json-str
:PROPERTIES:
:CUSTOM_ID: json-str
:END:
Return a single string where the row returned is a json object expressed as a string
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:= 'id 3)) :json-str)
  "{\"id\":3,\"int4\":3,\"text\":\"text three\"}"
#+END_SRC
As with :json-strs, this will also work for either simple-date or local-time timestamps

*** Json-array-str
:PROPERTIES:
:CUSTOM_ID: json-array-str
:END:
Return a string containing a json array, each element in the array is a selected row expressed as a json object. NOTE: If there is no result, this will return a string with an empty json array.
#+BEGIN_SRC lisp
  (query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :json-array-str)
  "[{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}, {\"id\":2,\"int4\":0,\"text\":\"text two\"}]"

  (query (:select 'id 'int4 'text :from 'test-data :where (:< 'id 1)) :json-array-str)
  "[]"
#+END_SRC
As with :json-strs, this will also work for either simple-date or local-time timestamps
*** Second value returned
:PROPERTIES:
:CUSTOM_ID: second-value-returned
:END:
If the database returns information about the amount rows that were affected,
such as with updating or deleting queries, this is returned as a second value.

