doc/postmodern.html
<div id="outline-container-plist" class="outline-4">
<h4 id="plist">Plist</h4>
<div class="outline-text-4" id="text-plist">
<p>
Returns a plist containing the field name as a keyword and the selected fields. Will throw an error if the query returns more than one row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:plist</span>)
(<span style="color: #23d7d7;">:ID</span> 3 <span style="color: #23d7d7;">:INT4</span> 3 <span style="color: #23d7d7;">:TEXT</span> <span style="color: #e67128;">"text three"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-plists" class="outline-4">
<h4 id="plists">Plists</h4>
<div class="outline-text-4" id="text-plists">
<p>
Returns a list of plists containing the field name as a keyword and the selected fields.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:plists</span>)
((<span style="color: #23d7d7;">:ID</span> 1 <span style="color: #23d7d7;">:INT4</span> 2147483645 <span style="color: #23d7d7;">:TEXT</span> <span style="color: #e67128;">"text one"</span>) (<span style="color: #23d7d7;">:ID</span> 2 <span style="color: #23d7d7;">:INT4</span> 0 <span style="color: #23d7d7;">:TEXT</span> <span style="color: #e67128;">"text two"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-vectors" class="outline-4">
<h4 id="vectors">Vectors</h4>
<div class="outline-text-4" id="text-vectors">
<p>
Returns a vector of vectors where each internal vector is a returned row from the query. The field names are not included. NOTE: It will return an empty vector instead of NIL if there is no result.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'test-data)
       <span style="color: #23d7d7;">:vectors</span>)
#(#(1 2147483645 <span style="color: #e67128;">"text one"</span>)
  #(2 0 <span style="color: #e67128;">"text two"</span>)
  #(3 3 <span style="color: #e67128;">"text three"</span>))

(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'test-data <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 1))
       <span style="color: #23d7d7;">:vectors</span>)
#()
</pre>
</div>
</div>
</div>
<div id="outline-container-array-hash" class="outline-4">
<h4 id="array-hash">Array-hash</h4>
<div class="outline-text-4" id="text-array-hash">
<p>
Returns a vector of hashtables where each hash table is a returned row from the query with field name as the key expressed as a lower case string.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:array-hash</span>)
#(#&lt;HASH-TABLE <span style="color: #23d7d7;">:TEST</span> EQUAL <span style="color: #23d7d7;">:COUNT</span> 3 {100D982B53}&gt;
  #&lt;HASH-TABLE <span style="color: #23d7d7;">:TEST</span> EQUAL <span style="color: #23d7d7;">:COUNT</span> 3 {100D982ED3}&gt;)

(alexandria:hash-table-alist
 (aref
  (query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:array-hash</span>)
  1))
((<span style="color: #e67128;">"text"</span> . <span style="color: #e67128;">"text two"</span>) (<span style="color: #e67128;">"int4"</span> . 0) (<span style="color: #e67128;">"id"</span> . 2))
</pre>
</div>
</div>
</div>
<div id="outline-container-dao-results" class="outline-4">
<h4 id="dao-results">Dao</h4>
<div class="outline-text-4" id="text-dao-results">
<p>
Returns a list of daos of the type specified
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country) (<span style="color: #23d7d7;">:dao</span> country))
(#&lt;COUNTRY {1010464023}&gt; #&lt;COUNTRY {1010465CB3}&gt;)

(query (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Croatia"</span>)) (<span style="color: #23d7d7;">:dao</span> country))
(#&lt;COUNTRY {1010688943}&gt;)
</pre>
</div>
</div>
</div>
<div id="outline-container-column-results" class="outline-4">
<h4 id="column-results">Column</h4>
<div class="outline-text-4" id="text-column-results">
<p>
Returns a list of field values of a single field. Will throw an error if more than one field is selected
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:column</span>)
(1 2)

(query (<span style="color: #23d7d7;">:select</span> 'id <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:column</span>)
(3)
</pre>
</div>
</div>
</div>
<div id="outline-container-json-strs" class="outline-4">
<h4 id="json-strs">Json-strs</h4>
<div class="outline-text-4" id="text-json-strs">
<p>
Return a list of strings where the row returned is a json object expressed as a string
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:json-strs</span>)
(<span style="color: #e67128;">"{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}"</span>
 <span style="color: #e67128;">"{\"id\":2,\"int4\":0,\"text\":\"text two\"}"</span>)
</pre>
</div>
<p>
This will also handle local-time timestamps and simple-date timestamps,
time-of-day and date. E.g. (with a local-time timestamp)
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'timestamp-with-time-zone
        <span style="color: #23d7d7;">:from</span> 'test-data
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3))
       <span style="color: #23d7d7;">:json-strs</span>)

'(<span style="color: #e67128;">"{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"</span>
  <span style="color: #e67128;">"{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}"</span>)
</pre>
</div>

<p>
The following is an example with a simple-date timestamp.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'timestamp-with-time-zone
        <span style="color: #23d7d7;">:from</span> 'test-data
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:json-strs</span>)
'(<span style="color: #e67128;">"{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"</span>
  <span style="color: #e67128;">"{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-json-str" class="outline-4">
<h4 id="json-str">Json-str</h4>
<div class="outline-text-4" id="text-json-str">
<p>
Return a single string where the row returned is a json object expressed as a string
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'id 3)) <span style="color: #23d7d7;">:json-str</span>)
<span style="color: #e67128;">"{\"id\":3,\"int4\":3,\"text\":\"text three\"}"</span>
</pre>
</div>
<p>
As with :json-strs, this will also work for either simple-date or local-time timestamps
</p>
</div>
</div>

<div id="outline-container-json-array-str" class="outline-4">
<h4 id="json-array-str">Json-array-str</h4>
<div class="outline-text-4" id="text-json-array-str">
<p>
Return a string containing a json array, each element in the array is a selected row expressed as a json object. NOTE: If there is no result, this will return a string with an empty json array.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'short-data-type-tests <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 3)) <span style="color: #23d7d7;">:json-array-str</span>)
<span style="color: #e67128;">"[{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}, {\"id\":2,\"int4\":0,\"text\":\"text two\"}]"</span>

(query (<span style="color: #23d7d7;">:select</span> 'id 'int4 'text <span style="color: #23d7d7;">:from</span> 'test-data <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&lt;</span> 'id 1)) <span style="color: #23d7d7;">:json-array-str</span>)
<span style="color: #e67128;">"[]"</span>
</pre>
</div>
<p>
As with :json-strs, this will also work for either simple-date or local-time timestamps
</p>
</div>
</div>
<div id="outline-container-second-value-returned" class="outline-4">
<h4 id="second-value-returned">Second value returned</h4>
<div class="outline-text-4" id="text-second-value-returned">
<p>
If the database returns information about the amount rows that were affected,
such as with updating or deleting queries, this is returned as a second value.
</p>
</div>
</div>
</div>
