doc/postmodern.org
** macro execute (query &rest args)
:PROPERTIES:
:CUSTOM_ID: macro-execute
:END:

Execute a query, ignore the results. So, in effect, Like a query called with
format :none. Returns the amount of affected rows as its first returned value.
(Also returns this amount as the second returned value, but use of this is
deprecated.)

** macro doquery (query (&rest names) &body body)
:PROPERTIES:
:CUSTOM_ID: macro-doquery
:END:

Execute the given query (a string or a list starting with a keyword), iterating
over the rows in the result. The body will be executed with the values in the
row bound to the symbols given in names. To iterate over a parameterised query,
one can specify a list whose car is the query, and whose cdr contains the
arguments.

An example using s-sql:
#+BEGIN_SRC lisp
  (doquery (:select 'name 'score :from 'scores) (n s)
    (incf (gethash n scores) s))

  (doquery ((:select 'name :from 'scores :where (:> 'score '$1)) 100) (name)
    (print name))
#+END_SRC
The same examples using plain sql:
#+BEGIN_SRC lisp
  (doquery "select name, score from scores" (n s)
    (incf (gethash n scores) s))

  (doquery ((:select 'name :from 'scores :where (:> 'score '$1)) 100) (name)
    (print name))
#+END_SRC

** macro prepare (query &optional (format :rows))
:PROPERTIES:
:CUSTOM_ID: macro-prepare
:END:
→ function

Wraps a query into a function that can be used as the interface to a prepared
statement. The given query (either a string or an S-SQL form) may contain
placeholders, which look like $1, $2, etc. The resulting function takes one
argument for every placeholder in the query, executes the prepared query, and
returns the result in the format specified. (Allowed formats are the same as for
query.)

#+begin_src lisp
  (let ((select-two (prepare (:select (:type '$1 'integer) (:type '$2 'string)))))
    (funcall select-two 1 "a"))

  (let ((getpid (prepare "select pg_backend_oid()" :single)))
    (funcall getpid))
#+end_src

For queries that have to be run very often, especially when they are complex,
it may help performance since the server only has to plan them once. See the [[http://www.postgresql.org/docs/current/static/sql-prepare.html][
PostgreSQL manual]] for details.

In some cases, the server will complain about not being able to deduce the type
of the arguments in a statement. In that case you should add type declarations
(either with the PostgreSQL's CAST SQL-conforming syntax or
historical :: syntax, or with S-SQL's :type construct) to help it out.

Note that it will attempt to automatically reconnect if
database-connection-error, or admin-shutdown. It will reset prepared statements
triggering an invalid-sql-statement-name error. It will overwrite old prepared
statements triggering a duplicate-prepared-statement error.

Example:
#+begin_src lisp
  (let ((select-int (prepare (:select (:type '$1 integer)) :single)))
    (funcall select-int 10))
#+end_src

** macro defprepared (name query &optional (format :rows))
:PROPERTIES:
:CUSTOM_ID: macro-def-prepared
:END:
→ function

This is a macro-style variant of prepare. It is like prepare, but gives the
function a name which now becomes a top-level function for the prepared
statement. The name should not a string but may be quoted.

Example:

#+begin_src lisp
  (defprepared 'select1 "select a from test_data where c = $1" :single)

  (funcall 'select1 "foobar")
#+end_src

** macro defprepared-with-names (name (&rest args) (query &rest query-args) &optional (format :rows))
:PROPERTIES:
:CUSTOM_ID: macro-defprepared-with-names
:END:

Like defprepared, but allows to specify names of the function arguments in a
lambda list as well as arguments supplied to the query.
#+BEGIN_SRC lisp
  (defprepared-with-names user-messages (user &key (limit 10))
    ("select * from messages
      where user_id = $1
      order by date desc
      limit $2" (user-id user) limit)
    :plists)
#+END_SRC

** macro with-transaction ((&optional name isolation-level) &body body)
:PROPERTIES:
:CUSTOM_ID: macro-with-transaction
:END:

Execute the given body within a database transaction, committing it when the
body exits normally, and aborting otherwise. An optional name and/or
isolation-level can be given to the transaction. The name can be used to
force a commit or abort before the body unwinds. The isolation-level
will set the isolation-level used by the transaction.

You can specify the following isolation levels in postmodern transactions:

- :read-committed-rw (read committed with read and write)
- :read-committed-ro (read committed with read only)
- :repeatable-read-rw (repeatable read with read and write)
- :repeatable-read-ro (repeatable read with read only)
- :serializable (serializable with reand and write)

Sample usage where "george" is just the name given to the transaction (not
quoted or a string) and ... simply indicates other statements would be
expected here:
#+BEGIN_SRC lisp
  (with-transaction ()
    (execute (:insert-into 'test-data :set 'value 77))
    ...)

  (with-transaction (george)
    (execute (:insert-into 'test-data :set 'value 22))
    ...)

  (with-transaction (george :read-committed-rw)
    (execute (:insert-into 'test-data :set 'value 33))
    (query (:select '* :from 'test-data))
    ...)

  (with-transaction (:serializable)
    (execute (:insert-into 'test-data :set 'value 44))
    ...)
#+END_SRC

Further discussion of transactions and isolation levels can found at
[[file:isolation-notes.html][isolation-notes.html]] in the doc directory.

** function commit-transaction (transaction)
:PROPERTIES:
:CUSTOM_ID: function-commit-transaction
:END:

Immediately commit an open transaction.

** function abort-transaction (transaction)
:PROPERTIES:
:CUSTOM_ID: function-abort-transaction
:END:

Roll back the given transaction, but the transaction
block is still active. Thus calling abort-transaction in the middle of a
transaction does not end the transaction. Any subsequent statements will still
be executed. Per the Postgresql documentation: ABORT rolls back the current
transaction and causes all the updates made by the transaction to be discarded.
This command is identical in behavior to the standard SQL command ROLLBACK, and
is present only for historical reasons..

