doc/postmodern.html

<div id="outline-container-macro-execute" class="outline-3">
<h3 id="macro-execute">macro execute (query &amp;rest args)</h3>
<div class="outline-text-3" id="text-macro-execute">
<p>
Execute a query, ignore the results. So, in effect, Like a query called with
format :none. Returns the amount of affected rows as its first returned value.
(Also returns this amount as the second returned value, but use of this is
deprecated.)
</p>
</div>
</div>

<div id="outline-container-macro-doquery" class="outline-3">
<h3 id="macro-doquery">macro doquery (query (&amp;rest names) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-doquery">
<p>
Execute the given query (a string or a list starting with a keyword), iterating
over the rows in the result. The body will be executed with the values in the
row bound to the symbols given in names. To iterate over a parameterised query,
one can specify a list whose car is the query, and whose cdr contains the
arguments.
</p>

<p>
An example using s-sql:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(doquery (<span style="color: #23d7d7;">:select</span> 'name 'score <span style="color: #23d7d7;">:from</span> 'scores) (n s)
  (incf (gethash n scores) s))

(doquery ((<span style="color: #23d7d7;">:select</span> 'name <span style="color: #23d7d7;">:from</span> 'scores <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&gt;</span> 'score '$1)) 100) (name)
  (print name))
</pre>
</div>
<p>
The same examples using plain sql:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(doquery <span style="color: #e67128;">"select name, score from scores"</span> (n s)
  (incf (gethash n scores) s))

(doquery ((<span style="color: #23d7d7;">:select</span> 'name <span style="color: #23d7d7;">:from</span> 'scores <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&gt;</span> 'score '$1)) 100) (name)
  (print name))
</pre>
</div>
</div>
</div>

<div id="outline-container-macro-prepare" class="outline-3">
<h3 id="macro-prepare">macro prepare (query &amp;optional (format :rows))</h3>
<div class="outline-text-3" id="text-macro-prepare">
<p>
→ function
</p>

<p>
Wraps a query into a function that can be used as the interface to a prepared
statement. The given query (either a string or an S-SQL form) may contain
placeholders, which look like $1, $2, etc. The resulting function takes one
argument for every placeholder in the query, executes the prepared query, and
returns the result in the format specified. (Allowed formats are the same as for
query.)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">let</span> ((select-two (prepare (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:type</span> '$1 'integer) (<span style="color: #23d7d7;">:type</span> '$2 'string)))))
  (funcall select-two 1 <span style="color: #e67128;">"a"</span>))

(<span style="color: #ffad29; font-weight: bold;">let</span> ((getpid (prepare <span style="color: #e67128;">"select pg_backend_oid()"</span> <span style="color: #23d7d7;">:single</span>)))
  (funcall getpid))
</pre>
</div>

<p>
For queries that have to be run very often, especially when they are complex,
it may help performance since the server only has to plan them once. See the <a href="http://www.postgresql.org/docs/current/static/sql-prepare.html">
PostgreSQL manual</a> for details.
</p>

<p>
In some cases, the server will complain about not being able to deduce the type
of the arguments in a statement. In that case you should add type declarations
(either with the PostgreSQL's CAST SQL-conforming syntax or
historical :: syntax, or with S-SQL's :type construct) to help it out.
</p>

<p>
Note that it will attempt to automatically reconnect if
database-connection-error, or admin-shutdown. It will reset prepared statements
triggering an invalid-sql-statement-name error. It will overwrite old prepared
statements triggering a duplicate-prepared-statement error.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">let</span> ((select-int (prepare (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:type</span> '$1 integer)) <span style="color: #23d7d7;">:single</span>)))
  (funcall select-int 10))
</pre>
</div>
</div>
</div>

<div id="outline-container-macro-def-prepared" class="outline-3">
<h3 id="macro-def-prepared">macro defprepared (name query &amp;optional (format :rows))</h3>
<div class="outline-text-3" id="text-macro-def-prepared">
<p>
→ function
</p>

<p>
This is a macro-style variant of prepare. It is like prepare, but gives the
function a name which now becomes a top-level function for the prepared
statement. The name should not a string but may be quoted.
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(defprepared 'select1 <span style="color: #e67128;">"select a from test_data where c = $1"</span> <span style="color: #23d7d7;">:single</span>)

(funcall 'select1 <span style="color: #e67128;">"foobar"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-macro-defprepared-with-names" class="outline-3">
<h3 id="macro-defprepared-with-names">macro defprepared-with-names (name (&amp;rest args) (query &amp;rest query-args) &amp;optional (format :rows))</h3>
<div class="outline-text-3" id="text-macro-defprepared-with-names">
<p>
Like defprepared, but allows to specify names of the function arguments in a
lambda list as well as arguments supplied to the query.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defprepared-with-names user-messages (user <span style="color: #34cae2;">&amp;key</span> (limit 10))
  (<span style="color: #e67128;">"select * from messages</span>
<span style="color: #e67128;">    where user_id = $1</span>
<span style="color: #e67128;">    order by date desc</span>
<span style="color: #e67128;">    limit $2"</span> (user-id user) limit)
  <span style="color: #23d7d7;">:plists</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-macro-with-transaction" class="outline-3">
<h3 id="macro-with-transaction">macro with-transaction ((&amp;optional name isolation-level) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-with-transaction">
<p>
Execute the given body within a database transaction, committing it when the
body exits normally, and aborting otherwise. An optional name and/or
isolation-level can be given to the transaction. The name can be used to
force a commit or abort before the body unwinds. The isolation-level
will set the isolation-level used by the transaction.
</p>

<p>
You can specify the following isolation levels in postmodern transactions:
</p>

<ul class="org-ul">
<li>:read-committed-rw (read committed with read and write)</li>
<li>:read-committed-ro (read committed with read only)</li>
<li>:repeatable-read-rw (repeatable read with read and write)</li>
<li>:repeatable-read-ro (repeatable read with read only)</li>
<li>:serializable (serializable with reand and write)</li>
</ul>

<p>
Sample usage where "george" is just the name given to the transaction (not
quoted or a string) and &#x2026; simply indicates other statements would be
expected here:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-transaction</span> ()
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 77))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-transaction</span> (george)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 22))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-transaction</span> (george <span style="color: #23d7d7;">:read-committed-rw</span>)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 33))
  (query (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'test-data))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-transaction</span> (<span style="color: #23d7d7;">:serializable</span>)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 44))
  ...)
</pre>
</div>

<p>
Further discussion of transactions and isolation levels can found at
<a href="isolation-notes.html">isolation-notes.html</a> in the doc directory.
</p>
</div>
</div>

<div id="outline-container-function-commit-transaction" class="outline-3">
<h3 id="function-commit-transaction">function commit-transaction (transaction)</h3>
<div class="outline-text-3" id="text-function-commit-transaction">
<p>
Immediately commit an open transaction.
</p>
</div>
</div>

<div id="outline-container-function-abort-transaction" class="outline-3">
<h3 id="function-abort-transaction">function abort-transaction (transaction)</h3>
<div class="outline-text-3" id="text-function-abort-transaction">
<p>
Roll back the given transaction, but the transaction
block is still active. Thus calling abort-transaction in the middle of a
transaction does not end the transaction. Any subsequent statements will still
be executed. Per the Postgresql documentation: ABORT rolls back the current
transaction and causes all the updates made by the transaction to be discarded.
This command is identical in behavior to the standard SQL command ROLLBACK, and
is present only for historical reasons..
</p>
</div>
</div>
