doc/postmodern.org
** function rollback-transaction (transaction)
:PROPERTIES:
:CUSTOM_ID: function-rollback-transaction
:END:
Roll back the given transaction, but the transaction
block is still active. Thus calling abort-transaction in the middle of a
transaction does not end the transaction. Any subsequent statements will still
be executed. Per the Postgresql documentation: this rolls back the current
transaction and causes all the updates made by the transaction to be discarded.

** macro with-savepoint (name &body body)
:PROPERTIES:
:CUSTOM_ID: macro-savepoint
:END:

Can only be used within a transaction. Establishes a savepoint with the given
name at the start of body, and binds the same name to a handle for that
savepoint. The body is executed and, at the end of body, the savepoint is
released, unless a condition is thrown, in which case it is rolled back.
Execute the body within a savepoint, releasing savepoint when the body exits
normally, and rolling back otherwise. NAME is both the variable that can be
used to release or rolled back before the body unwinds, and the SQL name of the
savepoint.

The following example demonstrates with-savepoint, rollback-savepoint and
release-savepoint.

#+BEGIN_SRC lisp
  (execute (:create-table test-data ((value :type integer))))

  (defun test12 (x &optional (y nil))
    (with-logical-transaction (lt1 :read-committed-rw)
      (execute (:insert-into 'test-data :set 'value 0))
      (with-savepoint sp1
        (execute (:insert-into 'test-data :set 'value 1))
        (format t "1-1. ~a Savepoint-name ~a~%" (query "select * from test_data")
                (pomo::savepoint-name sp1))
        (if (< x 0)
            (rollback-savepoint sp1)
            (release-savepoint sp1))
        (format t "1-2. ~a~%" (query "select * from test_data")))
      (with-savepoint sp2
        (execute (:insert-into 'test-data :set 'value 2))
        (format t "2-1. ~a Savepoint-name ~a~%" (query "select * from test_data")
                (pomo::savepoint-name sp2))
        (with-savepoint sp3
          (execute (:insert-into 'test-data :set 'value 3))
          (format t "3-1. ~a Savepoint-name ~a~%" (query "select * from test_data")
                  (pomo::savepoint-name sp3))
          (if (> x 0)
              (rollback-savepoint sp3)
              (release-savepoint sp3))
          (format t "3-2. ~a~%" (query "select * from test_data"))
          (when y (rollback-savepoint sp2))
          (format t "3-3. ~a~%" (query "select * from test_data")))
        (if (= x 0)
            (rollback-savepoint sp2)
            (release-savepoint sp2))
        (format t "2-2. ~a~%" (query "select * from test_data")))
      (format t "4. ~a~%" (query "select * from test_data"))
      (when (string= y "abrt")
        (abort-transaction lt1))
      (format t "5. ~a~%" (query "select * from test_data"))))
#+END_SRC

** function release-savepoint (savepoint)
:PROPERTIES:
:CUSTOM_ID: function-release-savepoint
:END:

Immediately release a savepoint, commiting its results.

** function rollback-savepoint (savepoint)
:PROPERTIES:
:CUSTOM_ID: function-rollback-savepoint
:END:

Immediately roll back a savepoint, aborting the results.

** method commit-hooks (transaction-or-savepoint), setf (commit-hooks transaction-or-savepoint)
:PROPERTIES:
:CUSTOM_ID: method-commit-hooks
:END:

An accessor for the transaction or savepoint's list of commit hooks, each of
which should be a function with no required arguments. These functions will be
executed when a transaction is committed or a savepoint released.

** function abort-hooks (transaction-or-savepoint), setf (abort-hooks transaction-or-savepoint)
:PROPERTIES:
:CUSTOM_ID: method-abort-hooks
:END:

An accessor for the transaction or savepoint's list of abort hooks, each of
which should be a function with no required arguments. These functions will be
executed when a transaction is aborted or a savepoint rolled back (whether via a
non-local transfer of control or explicitly by either abort-transaction or
rollback-savepoint).

** variable =*isolation-level*=
:PROPERTIES:
:CUSTOM_ID: variable-isolation-levels
:END:

The transaction isolation level currently in use. Defaults to :read-committed-rw

You can specify the following isolation levels in postmodern transactions:

- :read-committed-rw (read committed with read and write)
- :read-committed-ro (read committed with read only)
- :repeatable-read-rw (repeatable read with read and write)
- :repeatable-read-ro (repeatable read with read only)
- :serializable (serializable with reand and write)


** macro with-logical-transaction ((&optional name isolation-level) &body body)
:PROPERTIES:
:CUSTOM_ID: macro-with-logical-transaction
:END:

Executes body within a with-transaction form if no transaction is currently
in progress, otherwise simulates a nested transaction by executing it
within a with-savepoint form. The transaction or savepoint is bound to name
if one is supplied. The isolation-level will set the isolation-level used by the
transaction.

You can specify the following isolation levels in postmodern transactions:

- :read-committed-rw (read committed with read and write)
- :read-committed-ro (read committed with read only)
- :repeatable-read-rw (repeatable read with read and write)
- :repeatable-read-ro (repeatable read with read only)
- :serializable (serializable with reand and write)

For more information see [[file:isolation-notes.html][isolation-notes]]

Sample usage where "george" is just the name given to the transaction (not
quoted or a string) and ... simply indicates other statements would be
expected here:

#+BEGIN_SRC lisp
  (with-logical-transaction ()
    (execute (:insert-into 'test-data :set 'value 77))
    ...)

  (with-logical-transaction (george)
    (execute (:insert-into 'test-data :set 'value 22))
    ...)

  (with-logical-transaction (george :read-committed-rw)
    (execute (:insert-into 'test-data :set 'value 33))
    ...)

  (with-logical-transaction (:serializable)
    (execute (:insert-into 'test-data :set 'value 44))
    ...)
#+END_SRC

