doc/postmodern.html

<div id="outline-container-function-rollback-transaction" class="outline-3">
<h3 id="function-rollback-transaction">function rollback-transaction (transaction)</h3>
<div class="outline-text-3" id="text-function-rollback-transaction">
<p>
Roll back the given transaction, but the transaction
block is still active. Thus calling abort-transaction in the middle of a
transaction does not end the transaction. Any subsequent statements will still
be executed. Per the Postgresql documentation: this rolls back the current
transaction and causes all the updates made by the transaction to be discarded.
</p>
</div>
</div>

<div id="outline-container-macro-savepoint" class="outline-3">
<h3 id="macro-savepoint">macro with-savepoint (name &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-savepoint">
<p>
Can only be used within a transaction. Establishes a savepoint with the given
name at the start of body, and binds the same name to a handle for that
savepoint. The body is executed and, at the end of body, the savepoint is
released, unless a condition is thrown, in which case it is rolled back.
Execute the body within a savepoint, releasing savepoint when the body exits
normally, and rolling back otherwise. NAME is both the variable that can be
used to release or rolled back before the body unwinds, and the SQL name of the
savepoint.
</p>

<p>
The following example demonstrates with-savepoint, rollback-savepoint and
release-savepoint.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(execute (<span style="color: #23d7d7;">:create-table</span> test-data ((value <span style="color: #23d7d7;">:type</span> integer))))

(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">test12</span> (x <span style="color: #34cae2;">&amp;optional</span> (y nil))
  (<span style="color: #ffad29; font-weight: bold;">with-logical-transaction</span> (lt1 <span style="color: #23d7d7;">:read-committed-rw</span>)
    (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 0))
    (<span style="color: #ffad29; font-weight: bold;">with-savepoint</span> sp1
      (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 1))
      (format t <span style="color: #e67128;">"1-1. ~a Savepoint-name ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)
              (pomo::savepoint-name sp1))
      (<span style="color: #ffad29; font-weight: bold;">if</span> (&lt; x 0)
          (rollback-savepoint sp1)
          (release-savepoint sp1))
      (format t <span style="color: #e67128;">"1-2. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)))
    (<span style="color: #ffad29; font-weight: bold;">with-savepoint</span> sp2
      (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 2))
      (format t <span style="color: #e67128;">"2-1. ~a Savepoint-name ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)
              (pomo::savepoint-name sp2))
      (<span style="color: #ffad29; font-weight: bold;">with-savepoint</span> sp3
        (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 3))
        (format t <span style="color: #e67128;">"3-1. ~a Savepoint-name ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)
                (pomo::savepoint-name sp3))
        (<span style="color: #ffad29; font-weight: bold;">if</span> (&gt; x 0)
            (rollback-savepoint sp3)
            (release-savepoint sp3))
        (format t <span style="color: #e67128;">"3-2. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>))
        (<span style="color: #ffad29; font-weight: bold;">when</span> y (rollback-savepoint sp2))
        (format t <span style="color: #e67128;">"3-3. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)))
      (<span style="color: #ffad29; font-weight: bold;">if</span> (= x 0)
          (rollback-savepoint sp2)
          (release-savepoint sp2))
      (format t <span style="color: #e67128;">"2-2. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>)))
    (format t <span style="color: #e67128;">"4. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>))
    (<span style="color: #ffad29; font-weight: bold;">when</span> (string= y <span style="color: #e67128;">"abrt"</span>)
      (abort-transaction lt1))
    (format t <span style="color: #e67128;">"5. ~a~%"</span> (query <span style="color: #e67128;">"select * from test_data"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-function-release-savepoint" class="outline-3">
<h3 id="function-release-savepoint">function release-savepoint (savepoint)</h3>
<div class="outline-text-3" id="text-function-release-savepoint">
<p>
Immediately release a savepoint, commiting its results.
</p>
</div>
</div>

<div id="outline-container-function-rollback-savepoint" class="outline-3">
<h3 id="function-rollback-savepoint">function rollback-savepoint (savepoint)</h3>
<div class="outline-text-3" id="text-function-rollback-savepoint">
<p>
Immediately roll back a savepoint, aborting the results.
</p>
</div>
</div>

<div id="outline-container-method-commit-hooks" class="outline-3">
<h3 id="method-commit-hooks">method commit-hooks (transaction-or-savepoint), setf (commit-hooks transaction-or-savepoint)</h3>
<div class="outline-text-3" id="text-method-commit-hooks">
<p>
An accessor for the transaction or savepoint's list of commit hooks, each of
which should be a function with no required arguments. These functions will be
executed when a transaction is committed or a savepoint released.
</p>
</div>
</div>

<div id="outline-container-method-abort-hooks" class="outline-3">
<h3 id="method-abort-hooks">function abort-hooks (transaction-or-savepoint), setf (abort-hooks transaction-or-savepoint)</h3>
<div class="outline-text-3" id="text-method-abort-hooks">
<p>
An accessor for the transaction or savepoint's list of abort hooks, each of
which should be a function with no required arguments. These functions will be
executed when a transaction is aborted or a savepoint rolled back (whether via a
non-local transfer of control or explicitly by either abort-transaction or
rollback-savepoint).
</p>
</div>
</div>

<div id="outline-container-variable-isolation-levels" class="outline-3">
<h3 id="variable-isolation-levels">variable <code>*isolation-level*</code></h3>
<div class="outline-text-3" id="text-variable-isolation-levels">
<p>
The transaction isolation level currently in use. Defaults to :read-committed-rw
</p>

<p>
You can specify the following isolation levels in postmodern transactions:
</p>

<ul class="org-ul">
<li>:read-committed-rw (read committed with read and write)</li>
<li>:read-committed-ro (read committed with read only)</li>
<li>:repeatable-read-rw (repeatable read with read and write)</li>
<li>:repeatable-read-ro (repeatable read with read only)</li>
<li>:serializable (serializable with reand and write)</li>
</ul>
</div>
</div>


<div id="outline-container-macro-with-logical-transaction" class="outline-3">
<h3 id="macro-with-logical-transaction">macro with-logical-transaction ((&amp;optional name isolation-level) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-with-logical-transaction">
<p>
Executes body within a with-transaction form if no transaction is currently
in progress, otherwise simulates a nested transaction by executing it
within a with-savepoint form. The transaction or savepoint is bound to name
if one is supplied. The isolation-level will set the isolation-level used by the
transaction.
</p>

<p>
You can specify the following isolation levels in postmodern transactions:
</p>

<ul class="org-ul">
<li>:read-committed-rw (read committed with read and write)</li>
<li>:read-committed-ro (read committed with read only)</li>
<li>:repeatable-read-rw (repeatable read with read and write)</li>
<li>:repeatable-read-ro (repeatable read with read only)</li>
<li>:serializable (serializable with reand and write)</li>
</ul>

<p>
For more information see <a href="isolation-notes.html">isolation-notes</a>
</p>

<p>
Sample usage where "george" is just the name given to the transaction (not
quoted or a string) and &#x2026; simply indicates other statements would be
expected here:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-logical-transaction</span> ()
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 77))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-logical-transaction</span> (george)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 22))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-logical-transaction</span> (george <span style="color: #23d7d7;">:read-committed-rw</span>)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 33))
  ...)

(<span style="color: #ffad29; font-weight: bold;">with-logical-transaction</span> (<span style="color: #23d7d7;">:serializable</span>)
  (execute (<span style="color: #23d7d7;">:insert-into</span> 'test-data <span style="color: #23d7d7;">:set</span> 'value 44))
  ...)
</pre>
</div>
</div>
</div>
