doc/postmodern.org
** function abort-logical-transaction (transaction-or-savepoint)
:PROPERTIES:
:CUSTOM_ID: function-abort-logical-transaction
:END:

Roll back the given logical transaction, regardless of whether it is an actual
transaction or a savepoint.

** function commit-logical-transaction (transaction-or-savepoint)
:PROPERTIES:
:CUSTOM_ID: function-commit-logical-transaction
:END:

Commit the given logical transaction, regardless of whether it is an actual
transaction or a savepoint.

** variable =*current-logical-transaction*=
:PROPERTIES:
:CUSTOM_ID: variable-current-logical-transaction
:END:

This is bound to the current transaction-handle or savepoint-handle instance
representing the innermost open logical transaction.

** macro ensure-transaction (&body body)
:PROPERTIES:
:CUSTOM_ID: macro-ensure-transaction
:END:

Ensures that body is executed within a transaction, but does not begin a new
transaction if one is already in progress.

** macro ensure-transaction-with-isolation-level (isolation-level &body body)
:PROPERTIES:
:CUSTOM_ID: macro-ensure-transaction-with-isolation-level
:END:

Executes body within a with-transaction form if and only if no transaction is
already in progress. This adds the ability to specify an isolation level other
than the current default

* Helper functions for Prepared Statements
:PROPERTIES:
:CUSTOM_ID: prepared-statement-helper-functions
:END:

** defparameter *allow-overwriting-prepared-statements*
:PROPERTIES:
:CUSTOM_ID: variable-allow-overwriting-prepared-statements
:END:

When set to t, ensured-prepared will overwrite prepared statements having the
same name if the query statement itself in the postmodern meta connection is
different than the query statement provided to ensure-prepared.

** function prepared-statement-exists-p (name)
:PROPERTIES:
:CUSTOM_ID: function-prepared-statement-exists-p
:END:
→ boolean
This returns t if the prepared statement exists in the current postgresql
session, otherwise nil.

** function list-prepared-statements (&optional (names-only nil))
:PROPERTIES:
:CUSTOM_ID: function-list-prepared-statements
:END:
→ list

This is syntactic sugar. It runs a query that lists the prepared statements in
the session in which the function is run. If the names-only parameter is set
to t, it will only return a list of the names of the prepared statements.

** function drop-prepared-statement (statement-name &key (location :both) (database =*database*=))
:PROPERTIES:
:CUSTOM_ID: function-drop-prepared-statement
:END:

The statement name can be a string or quoted symbol.

Prepared statements are stored both in the meta slot in the postmodern
connection and in postgresql session information. In the case of prepared
statements generated with defprepared, there is also a lisp function with
the same name.

If you know the prepared statement name, you can delete the prepared statement
from both locations (the default behavior), just from postmodern by passing
:postmodern to the location key parameter or just from postgresql by passing
:postgresql to the location key parameter.

If you pass the name 'All' as the statement name, it will
delete all prepared statements.

The default behavior is to also remove any lisp function of the same name.
This behavior is controlled by the remove-function key parameter.

** function list-postmodern-prepared-statements (&optional (names-only nil))
:PROPERTIES:
:CUSTOM_ID: function-list-postmodern-prepared-statements
:END:
→ list

List the prepared statements that postmodern has put in the meta slot in the
connection. It will return a list of alists of form:
((:NAME . \"SNY24\")
(:STATEMENT . \"(SELECT name, salary FROM employee WHERE (city = $1))\")
(:PREPARE-TIME . #<TIMESTAMP 25-11-2018T15:36:43,385>)
(:PARAMETER-TYPES . \"{text}\") (:FROM-SQL)

If the names-only parameter is set to t, it will only return a list of
the names of the prepared statements.

** function find-postgresql-prepared-statement (name)
:PROPERTIES:
:CUSTOM_ID: function-find-postgresql-prepared-statement
:END:
→ string

Returns the specified named prepared statement (if any) that postgresql has for
this session and placed in the meta slot in the connection.

** function find-postmodern-prepared-statement (name)
:PROPERTIES:
:CUSTOM_ID: function-find-postmodern-prepared-statement
:END:
→ string

Returns the specified named prepared statement (if any) that postmodern has put
in the meta slot in the connection. Note that this is the statement itself, not
the name.

** function reset-prepared-statement (condition)
:PROPERTIES:
:CUSTOM_ID: function-reset-prepared-statement
:END:
→ restart

If you have received an invalid-prepared-statement error but the prepared
statement is still in the meta slot in the postmodern connection, this will try
to regenerate the prepared statement at the database connection level and
restart the connection.

** function get-pid ()
:PROPERTIES:
:CUSTOM_ID: function-get-pid
:END:
→ integer

Get the process id used by postgresql for this connection.

** function get-pid-from-postmodern ()
:PROPERTIES:
:CUSTOM_ID: function-get-pid-from-postmodern
:END:
→ integer

Get the process id used by postgresql for this connection, but get it from the
postmodern connection parameters.

** function cancel-backend (pid)
:PROPERTIES:
:CUSTOM_ID: function-cancel-backend
:END:

Polite way of terminating a query at the database (as opposed to calling
close-database). This is slower than (terminate-backend pid) and does not
always work.

** function terminate-backend (pid)
:PROPERTIES:
:CUSTOM_ID: function-terminate-backend
:END:

Less polite way of terminating at the database (as opposed to calling
close-database). Faster than (cancel-backend pid) and more reliable.
* Database Management
:PROPERTIES:
:CUSTOM_ID: database-management
:END:

