doc/postmodern.html

<div id="outline-container-function-abort-logical-transaction" class="outline-3">
<h3 id="function-abort-logical-transaction">function abort-logical-transaction (transaction-or-savepoint)</h3>
<div class="outline-text-3" id="text-function-abort-logical-transaction">
<p>
Roll back the given logical transaction, regardless of whether it is an actual
transaction or a savepoint.
</p>
</div>
</div>

<div id="outline-container-function-commit-logical-transaction" class="outline-3">
<h3 id="function-commit-logical-transaction">function commit-logical-transaction (transaction-or-savepoint)</h3>
<div class="outline-text-3" id="text-function-commit-logical-transaction">
<p>
Commit the given logical transaction, regardless of whether it is an actual
transaction or a savepoint.
</p>
</div>
</div>

<div id="outline-container-variable-current-logical-transaction" class="outline-3">
<h3 id="variable-current-logical-transaction">variable <code>*current-logical-transaction*</code></h3>
<div class="outline-text-3" id="text-variable-current-logical-transaction">
<p>
This is bound to the current transaction-handle or savepoint-handle instance
representing the innermost open logical transaction.
</p>
</div>
</div>

<div id="outline-container-macro-ensure-transaction" class="outline-3">
<h3 id="macro-ensure-transaction">macro ensure-transaction (&amp;body body)</h3>
<div class="outline-text-3" id="text-macro-ensure-transaction">
<p>
Ensures that body is executed within a transaction, but does not begin a new
transaction if one is already in progress.
</p>
</div>
</div>

<div id="outline-container-macro-ensure-transaction-with-isolation-level" class="outline-3">
<h3 id="macro-ensure-transaction-with-isolation-level">macro ensure-transaction-with-isolation-level (isolation-level &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-ensure-transaction-with-isolation-level">
<p>
Executes body within a with-transaction form if and only if no transaction is
already in progress. This adds the ability to specify an isolation level other
than the current default
</p>
</div>
</div>
</div>

<div id="outline-container-prepared-statement-helper-functions" class="outline-2">
<h2 id="prepared-statement-helper-functions">Helper functions for Prepared Statements</h2>
<div class="outline-text-2" id="text-prepared-statement-helper-functions">
</div>

<div id="outline-container-variable-allow-overwriting-prepared-statements" class="outline-3">
<h3 id="variable-allow-overwriting-prepared-statements">defparameter <b>allow-overwriting-prepared-statements</b></h3>
<div class="outline-text-3" id="text-variable-allow-overwriting-prepared-statements">
<p>
When set to t, ensured-prepared will overwrite prepared statements having the
same name if the query statement itself in the postmodern meta connection is
different than the query statement provided to ensure-prepared.
</p>
</div>
</div>

<div id="outline-container-function-prepared-statement-exists-p" class="outline-3">
<h3 id="function-prepared-statement-exists-p">function prepared-statement-exists-p (name)</h3>
<div class="outline-text-3" id="text-function-prepared-statement-exists-p">
<p>
→ boolean
This returns t if the prepared statement exists in the current postgresql
session, otherwise nil.
</p>
</div>
</div>

<div id="outline-container-function-list-prepared-statements" class="outline-3">
<h3 id="function-list-prepared-statements">function list-prepared-statements (&amp;optional (names-only nil))</h3>
<div class="outline-text-3" id="text-function-list-prepared-statements">
<p>
→ list
</p>

<p>
This is syntactic sugar. It runs a query that lists the prepared statements in
the session in which the function is run. If the names-only parameter is set
to t, it will only return a list of the names of the prepared statements.
</p>
</div>
</div>

<div id="outline-container-function-drop-prepared-statement" class="outline-3">
<h3 id="function-drop-prepared-statement">function drop-prepared-statement (statement-name &amp;key (location :both) (database <code>*database*</code>))</h3>
<div class="outline-text-3" id="text-function-drop-prepared-statement">
<p>
The statement name can be a string or quoted symbol.
</p>

<p>
Prepared statements are stored both in the meta slot in the postmodern
connection and in postgresql session information. In the case of prepared
statements generated with defprepared, there is also a lisp function with
the same name.
</p>

<p>
If you know the prepared statement name, you can delete the prepared statement
from both locations (the default behavior), just from postmodern by passing
:postmodern to the location key parameter or just from postgresql by passing
:postgresql to the location key parameter.
</p>

<p>
If you pass the name 'All' as the statement name, it will
delete all prepared statements.
</p>

<p>
The default behavior is to also remove any lisp function of the same name.
This behavior is controlled by the remove-function key parameter.
</p>
</div>
</div>

<div id="outline-container-function-list-postmodern-prepared-statements" class="outline-3">
<h3 id="function-list-postmodern-prepared-statements">function list-postmodern-prepared-statements (&amp;optional (names-only nil))</h3>
<div class="outline-text-3" id="text-function-list-postmodern-prepared-statements">
<p>
→ list
</p>

<p>
List the prepared statements that postmodern has put in the meta slot in the
connection. It will return a list of alists of form:
((:NAME . \"SNY24\")
(:STATEMENT . \"(SELECT name, salary FROM employee WHERE (city = $1))\")
(:PREPARE-TIME . #&lt;TIMESTAMP 25-11-2018T15:36:43,385&gt;)
(:PARAMETER-TYPES . \"{text}\") (:FROM-SQL)
</p>

<p>
If the names-only parameter is set to t, it will only return a list of
the names of the prepared statements.
</p>
</div>
</div>

<div id="outline-container-function-find-postgresql-prepared-statement" class="outline-3">
<h3 id="function-find-postgresql-prepared-statement">function find-postgresql-prepared-statement (name)</h3>
<div class="outline-text-3" id="text-function-find-postgresql-prepared-statement">
<p>
→ string
</p>

<p>
Returns the specified named prepared statement (if any) that postgresql has for
this session and placed in the meta slot in the connection.
</p>
</div>
</div>

<div id="outline-container-function-find-postmodern-prepared-statement" class="outline-3">
<h3 id="function-find-postmodern-prepared-statement">function find-postmodern-prepared-statement (name)</h3>
<div class="outline-text-3" id="text-function-find-postmodern-prepared-statement">
<p>
→ string
</p>

<p>
Returns the specified named prepared statement (if any) that postmodern has put
in the meta slot in the connection. Note that this is the statement itself, not
the name.
</p>
</div>
</div>

<div id="outline-container-function-reset-prepared-statement" class="outline-3">
<h3 id="function-reset-prepared-statement">function reset-prepared-statement (condition)</h3>
<div class="outline-text-3" id="text-function-reset-prepared-statement">
<p>
→ restart
</p>

<p>
If you have received an invalid-prepared-statement error but the prepared
statement is still in the meta slot in the postmodern connection, this will try
to regenerate the prepared statement at the database connection level and
restart the connection.
</p>
</div>
</div>

<div id="outline-container-function-get-pid" class="outline-3">
<h3 id="function-get-pid">function get-pid ()</h3>
<div class="outline-text-3" id="text-function-get-pid">
<p>
→ integer
</p>

<p>
Get the process id used by postgresql for this connection.
</p>
</div>
</div>

<div id="outline-container-function-get-pid-from-postmodern" class="outline-3">
<h3 id="function-get-pid-from-postmodern">function get-pid-from-postmodern ()</h3>
<div class="outline-text-3" id="text-function-get-pid-from-postmodern">
<p>
→ integer
</p>

<p>
Get the process id used by postgresql for this connection, but get it from the
postmodern connection parameters.
</p>
</div>
</div>

<div id="outline-container-function-cancel-backend" class="outline-3">
<h3 id="function-cancel-backend">function cancel-backend (pid)</h3>
<div class="outline-text-3" id="text-function-cancel-backend">
<p>
Polite way of terminating a query at the database (as opposed to calling
close-database). This is slower than (terminate-backend pid) and does not
always work.
</p>
</div>
</div>

<div id="outline-container-function-terminate-backend" class="outline-3">
<h3 id="function-terminate-backend">function terminate-backend (pid)</h3>
<div class="outline-text-3" id="text-function-terminate-backend">
<p>
Less polite way of terminating at the database (as opposed to calling
close-database). Faster than (cancel-backend pid) and more reliable.
</p>
</div>
</div>
</div>
<div id="outline-container-database-management" class="outline-2">
<h2 id="database-management">Database Management</h2>
<div class="outline-text-2" id="text-database-management">
</div>
