doc/postmodern.html

<div id="outline-container-function-create-database" class="outline-3">
<h3 id="function-create-database">function create-database (database-name &amp;key (encoding "UTF8") (connection-limit -1) owner limit-public-access comment collation template)</h3>
<div class="outline-text-3" id="text-function-create-database">
<p>
Creates a basic database. Besides the obvious database-name parameter, you
can also use key parameters to set encoding (defaults to UTF8), owner,
connection-limit (defaults to no limit)). If limit-public-access is set to t,
then only superuser roles or roles with explicit access to this database will
be able to access it. See <a href="#roles">Roles</a>.
</p>

<p>
If collation is set, the assumption is that template0 needs to be used as the base
of the database rather than template1 which may contain encoding specific or locale
specific data.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(create-database 'testdb <span style="color: #23d7d7;">:limit-public-access</span> t
                         <span style="color: #23d7d7;">:comment</span> <span style="color: #e67128;">"This database is for testing silly theories"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-function-drop-database" class="outline-3">
<h3 id="function-drop-database">function drop-database (database)</h3>
<div class="outline-text-3" id="text-function-drop-database">
<p>
Drop the specified database. The database parameter can be a string or a
symbol. Note: Only the owner of a database (or superuser) can drop a database
and there cannot be any current connections to the database.
[[#database-information][See Database information below for information specific functions]
</p>
</div>
</div>
</div>

<div id="outline-container-table-definition" class="outline-2">
<h2 id="table-definition">Table definition and creation using a dao</h2>
<div class="outline-text-2" id="text-table-definition">
<p>
See: <a href="dao-classes.html#table-definition">Creating Tables using dao classes</a>
</p>
</div>
</div>

<div id="outline-container-roles" class="outline-2">
<h2 id="roles">Roles</h2>
<div class="outline-text-2" id="text-roles">
<p>
Every connection is specific to a particular database. However, creating roles
or users is global to the entire cluster (the running postgresql server). You
can create policies for any individual database, schema or table, but you need
to ensure that those policies also apply to any subsequently created database,
schema or table. Note that each user is automatically a member of the public
group, so you need to change those policies for public as well.
</p>

<p>
Per the Postgresql Documentation, CREATE ROLE adds a new role to a PostgreSQL
database cluster. A role is an entity that can own database objects and have
database privileges; a role can be considered a “user”, a “group”, or both
depending on how it is used.
<a href="https://www.postgresql.org/docs/current/sql-createrole.html">https://www.postgresql.org/docs/current/sql-createrole.html</a>. The only real
difference between "create role" and "create user" is that create user
defaults to having a login attribute and create role defaults to not having
a login attribute.
</p>

<p>
Often applications will have their own concept of users and the application
will itself have one or more types of roles to which the application user is
assigned. So, for example, the application may have two roles - reader and
editor with which it interacts with postgresql and then there are many
application users registered with the application and probably listed in some
type of user table in postgresql that the application manages. When users 1,2
or 3 log in to the application, the application might connect to the postgresql
cluster using a role that only has read (select) permissions. When users 4 or 5
log in to the application, the applicatin might connect to the postgresql cluster
using a role that has read, insert, update and delete permission. Postmodern
provides a simplified create-role system allowing easy creation of roles that
have readonly, editor or superuser type permissions. Further, those
permissions can be limited to individual databases, schemas or tables.
</p>

<p>
We suggest that you separate application users from roles. Make it easy to
drop application users. Dropping roles requires going through every database,
reassigning ownership of any objects that role might own or have privileges
on, then dropping ownership of objects, then dropping the role itself.
</p>
</div>

<div id="outline-container-function-role-exists-p" class="outline-3">
<h3 id="function-role-exists-p">function role-exists-p (role-name)</h3>
<div class="outline-text-3" id="text-function-role-exists-p">
<p>
→ boolean
</p>

<p>
Does the named role exist in this database cluster? Returns t or nil.
</p>
</div>
</div>
<div id="outline-container-function-create-role" class="outline-3">
<h3 id="function-create-role">function create-role</h3>
<div class="outline-text-3" id="text-function-create-role">
<p>
(name password &amp;key (base-role :readonly) (schema :public)
                                    (tables :all) (databases :current)
                                    (allow-whitespace nil)
                                    (allow-utf8 nil)
                                    (allow-disallowed-names nil) (comment nil))
</p>

<p>
Keyword parameters: Base-role. Base-role should be one of :readonly, :editor,
:admin, :standard or :superuser. A readonly user can only select existing data in the
specified tables or databases. An editor has the ability to insert, update,
delete or select data. An admin has all privileges on a database, but cannot
create new databases, roles, or replicate the system. A standard user has no
particular privileges other than connecting to databases.
</p>

<p>
 :schema defaults to :public but can be a list of schemas. User will not have
access to any schemas not in the list.
</p>

<p>
 :tables defaults to :all but can be a list of tables. User will not have access
to any tables not in the list.
</p>

<p>
 :databases defaults to :current but can be a list of databases. User will not
have access to any databases not in the list.
</p>

<p>
 :allow-whitespace - Whitespace in either the name or password is not allowed by
default.
</p>

<p>
 :allow-utf8 defaults to nil. If t, the name and password will be normalized. If
nil, the name and password are limited to printable ascii characters. For fun
reading on utf8 user names see
<a href="https://labs.spotify.com/2013/06/18/creative-usernames">https://labs.spotify.com/2013/06/18/creative-usernames</a>. Also interesting reading
is <a href="https://github.com/flurdy/bad_usernames">https://github.com/flurdy/bad_usernames</a> and <a href="https://github.com/dsignr/disallowed-usernames/blob/master/disallowed%20usernames.csv">https://github.com/dsignr/disallowed-usernames/blob/master/disallowed%20usernames.csv</a>,
and <a href="https://www.b-list.org/weblog/2018/feb/11/usernames/">https://www.b-list.org/weblog/2018/feb/11/usernames/</a>
</p>

<p>
 :allow-disallowed-names defaults to nil. If nil, the user name will be checked
against <code>*disallowed-role-names*</code>.
</p>

<p>
 As an aside, if allowing utf8 in names, you might want to think about whether
you should second copy of the username in the original casing and normalized as
NFC for display purposes as opposed to normalizing to NFKC. It might be viewed
as culturally insensitive to change the display of the name.
</p>
</div>
</div>
<div id="outline-container-function-drop-role" class="outline-3">
<h3 id="function-drop-role">function drop-role (role-name &amp;optional (new-owner "postgres") (database :all))</h3>
<div class="outline-text-3" id="text-function-drop-role">
<p>
→ boolean
</p>

<p>
The role-name and optional new-owner name should be strings. If they are
symbols, they will be converted to string and hyphens will be converted to
underscores.
</p>

<p>
Before dropping the role, you must drop all the objects it owns (or reassign
their ownership) and revoke any privileges the role has been granted on other
objects. If database is :all, drop-role will loop through all databases in
the cluster ensuring that the role has no privileges or owned objects in
every database. Otherwise drop-role will drop objects owned by a role in the
current database.
</p>

<p>
We will reassign ownership of the objects to the postgres role
unless otherwise specified in the optional second parameter. Returns t if
successful. Will not drop the postgres role.
</p>
</div>
</div>
