doc/postmodern.org
** function alter-role-search-path (role search-path)
   :PROPERTIES:
   :CUSTOM_ID: function-alter-role
   :END:

Changes the priority of where a role looks for tables (which schema first,
second, etc. Role should be a string or symbol. Search-path could be a list of schema
names either as strings or symbols.
** function change-password (role password &optional expiration-date)
   :PROPERTIES:
   :CUSTOM_ID: function-change-password
   :END:

Alters a role's password. If the optional expiration-date parameter is provided,
the password will expire at the stated date. A sample expiration date would be
'December 31, 2020'. If the expiration date is 'infinity', it will never expire.
The password will be encrypted in the system catalogs. This is
automatic with postgresql versions 10 and above.

** function grant-role-permissions (role-type name &key (schema :public) (tables :all) (databases :all))
   :PROPERTIES:
   :CUSTOM_ID: function-grant-role-permissions
   :END:

Grant-role-permissions assumes that a role has already been created, but
permissions need to be granted or revoked on a particular database.

   A  :superuser can create databases, roles, replication, etc. Returns nil.
   A  :standard user has no particular privileges or restrictions. Returns nil.
   An :admin user can edit existing data, insert new data and create new tables
in the specified databases/schemas/tables.
   An :editor user can update fields or insert new records but cannot create new
tables in the specified tables or databases.
   A  :readonly role can only read existing data in the specified schemas,
tables or databases. Schema, tables or databases can be :all or a list of
schemas, tables or databases to be granted permission.

  Granting :all provides access to all future items of that type as well.

  Note that the schema and table rights and revocations granted are limited to
the connected database at the time of execution of this function.
** function grant-readonly-permissions (schema-name role-name &optional (table-name nil))
   :PROPERTIES:
   :CUSTOM_ID: function-grant-readonly-permissions
   :END:

Grants select privileges to a role for the named schema. If the optional
table-name parameter is provided, the privileges are only granted with respect
to that table. Note that we are giving some function execute permissions if
table-name is nil, but if the table-name is specified, those are not provided.
Your mileage may vary on how many privileges you want to provide to a
read-only role with access to only a limited number of tables.
** function grant-editor-permissions (schema-name role-name &optional (table-name nil))
   :PROPERTIES:
   :CUSTOM_ID: function-grant-editor-permissions
   :END:

Grants select, insert, update and delete privileges to a role for the named
schema. If the optional table-name parameter is provided, the privileges are only
granted with respect to that table. Note that we are giving some function execute
permissions if table-name is nil, but if the table-name is specified, those are
not provided. Your mileage may vary on how many privileges you want to provide
to a editor role with access to only a limited number of tables.
** function grant-admin-permissions (schema-name role-name &optional (table-name nil))
   :PROPERTIES:
   :CUSTOM_ID: function-grant-admin-permissions
   :END:

Grants all privileges to a role for the named schema. If the optional table-name
parameter is provided, the privileges are only granted with respect to that table.
** function revoke-all-on-table (table-name role-name)
   :PROPERTIES:
   :CUSTOM_ID: function-revoke-all-on-table
   :END:

Takes a table-name which could be a string, symbol or list of strings or
symbols of tables names, a role name and revokes all privileges that
role-name may have with that/those tables. This is limited to the currently
connected database and can only revoke the privileges granted by the caller
of the function.
** function list-role-accessible-databases (role-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-role-accessible-databases
   :END:
→ list

Returns a list of the databases to which the specified role can connect.
** function list-roles (&optional (lt nil))
   :PROPERTIES:
   :CUSTOM_ID: function-list-roles
   :END:
→ list

Returns a list of alists of rolenames, role attributes and membership in roles.
See https://www.postgresql.org/docs/current/role-membership.html for an
explanation. Optionally passing :alists or :plists can be used to set the return
list types to :alists or :plists. This is the same as the psql function \du.

** function list-role-permissions (&optional role)
   :PROPERTIES:
   :CUSTOM_ID: function-list-role-permissions
   :END:
→ list

This returns a list of sublists of the permissions granted  within the
currently connected database. If an optional role is provided, the result is
limited to that role. The sublist returned will be in the form of role-name,
schema-name, table-name and then a string containing all the rights of that role
on that table in that schema.
* Database Information
  :PROPERTIES:
  :CUSTOM_ID: database-information
  :END:
** function add-comment (type name comment &optional (second-name ""))
   :PROPERTIES:
   :CUSTOM_ID: funciton-add-comment
   :END:

Attempts to add a comment to a particular database object. The first parameter is a keyword for the type of database object. The second parameter is the name of the object. The third parameter is the comment itself. Some objects require an additional identifier. The names can be strings or symbols.

Example usage would be:
#+BEGIN_SRC lisp
 (add-comment :database 'my-database-name "Does anyone actually use this database?")

 (add-comment :column 'country-locations.name "Is what it looks like - the name of a country")

 (add-comment :column "country_locations.name" "Is what it looks like - the name of a country")
#+END_SRC

Example usage where two identifiers are required would be constraints:
#+BEGIN_SRC lisp
 (add-comment :constraint 'constraint1  "Some kind of constraint descriptions here"
              'country-locations)
#+END_SRC

** find-comments (type identifier)
:PROPERTIES:
:CUSTOM_ID: function-find-comments
:END:
Returns the comments attached to a particular database object. The allowed
types are :database :schema :table :columns (all the columns in a table)
:column (for a single column).

An example would be (find-comments :table 's2.employees) where the table employees
is in the s2 schema.
