doc/postmodern.html
<div id="outline-container-function-alter-role" class="outline-3">
<h3 id="function-alter-role">function alter-role-search-path (role search-path)</h3>
<div class="outline-text-3" id="text-function-alter-role">
<p>
Changes the priority of where a role looks for tables (which schema first,
second, etc. Role should be a string or symbol. Search-path could be a list of schema
names either as strings or symbols.
</p>
</div>
</div>
<div id="outline-container-function-change-password" class="outline-3">
<h3 id="function-change-password">function change-password (role password &amp;optional expiration-date)</h3>
<div class="outline-text-3" id="text-function-change-password">
<p>
Alters a role's password. If the optional expiration-date parameter is provided,
the password will expire at the stated date. A sample expiration date would be
'December 31, 2020'. If the expiration date is 'infinity', it will never expire.
The password will be encrypted in the system catalogs. This is
automatic with postgresql versions 10 and above.
</p>
</div>
</div>

<div id="outline-container-function-grant-role-permissions" class="outline-3">
<h3 id="function-grant-role-permissions">function grant-role-permissions (role-type name &amp;key (schema :public) (tables :all) (databases :all))</h3>
<div class="outline-text-3" id="text-function-grant-role-permissions">
<p>
Grant-role-permissions assumes that a role has already been created, but
permissions need to be granted or revoked on a particular database.
</p>

<p>
   A  :superuser can create databases, roles, replication, etc. Returns nil.
   A  :standard user has no particular privileges or restrictions. Returns nil.
   An :admin user can edit existing data, insert new data and create new tables
in the specified databases/schemas/tables.
   An :editor user can update fields or insert new records but cannot create new
tables in the specified tables or databases.
   A  :readonly role can only read existing data in the specified schemas,
tables or databases. Schema, tables or databases can be :all or a list of
schemas, tables or databases to be granted permission.
</p>

<p>
Granting :all provides access to all future items of that type as well.
</p>

<p>
  Note that the schema and table rights and revocations granted are limited to
the connected database at the time of execution of this function.
</p>
</div>
</div>
<div id="outline-container-function-grant-readonly-permissions" class="outline-3">
<h3 id="function-grant-readonly-permissions">function grant-readonly-permissions (schema-name role-name &amp;optional (table-name nil))</h3>
<div class="outline-text-3" id="text-function-grant-readonly-permissions">
<p>
Grants select privileges to a role for the named schema. If the optional
table-name parameter is provided, the privileges are only granted with respect
to that table. Note that we are giving some function execute permissions if
table-name is nil, but if the table-name is specified, those are not provided.
Your mileage may vary on how many privileges you want to provide to a
read-only role with access to only a limited number of tables.
</p>
</div>
</div>
<div id="outline-container-function-grant-editor-permissions" class="outline-3">
<h3 id="function-grant-editor-permissions">function grant-editor-permissions (schema-name role-name &amp;optional (table-name nil))</h3>
<div class="outline-text-3" id="text-function-grant-editor-permissions">
<p>
Grants select, insert, update and delete privileges to a role for the named
schema. If the optional table-name parameter is provided, the privileges are only
granted with respect to that table. Note that we are giving some function execute
permissions if table-name is nil, but if the table-name is specified, those are
not provided. Your mileage may vary on how many privileges you want to provide
to a editor role with access to only a limited number of tables.
</p>
</div>
</div>
<div id="outline-container-function-grant-admin-permissions" class="outline-3">
<h3 id="function-grant-admin-permissions">function grant-admin-permissions (schema-name role-name &amp;optional (table-name nil))</h3>
<div class="outline-text-3" id="text-function-grant-admin-permissions">
<p>
Grants all privileges to a role for the named schema. If the optional table-name
parameter is provided, the privileges are only granted with respect to that table.
</p>
</div>
</div>
<div id="outline-container-function-revoke-all-on-table" class="outline-3">
<h3 id="function-revoke-all-on-table">function revoke-all-on-table (table-name role-name)</h3>
<div class="outline-text-3" id="text-function-revoke-all-on-table">
<p>
Takes a table-name which could be a string, symbol or list of strings or
symbols of tables names, a role name and revokes all privileges that
role-name may have with that/those tables. This is limited to the currently
connected database and can only revoke the privileges granted by the caller
of the function.
</p>
</div>
</div>
<div id="outline-container-function-list-role-accessible-databases" class="outline-3">
<h3 id="function-list-role-accessible-databases">function list-role-accessible-databases (role-name)</h3>
<div class="outline-text-3" id="text-function-list-role-accessible-databases">
<p>
→ list
</p>

<p>
Returns a list of the databases to which the specified role can connect.
</p>
</div>
</div>
<div id="outline-container-function-list-roles" class="outline-3">
<h3 id="function-list-roles">function list-roles (&amp;optional (lt nil))</h3>
<div class="outline-text-3" id="text-function-list-roles">
<p>
→ list
</p>

<p>
Returns a list of alists of rolenames, role attributes and membership in roles.
See <a href="https://www.postgresql.org/docs/current/role-membership.html">https://www.postgresql.org/docs/current/role-membership.html</a> for an
explanation. Optionally passing :alists or :plists can be used to set the return
list types to :alists or :plists. This is the same as the psql function \du.
</p>
</div>
</div>

<div id="outline-container-function-list-role-permissions" class="outline-3">
<h3 id="function-list-role-permissions">function list-role-permissions (&amp;optional role)</h3>
<div class="outline-text-3" id="text-function-list-role-permissions">
<p>
→ list
</p>

<p>
This returns a list of sublists of the permissions granted  within the
currently connected database. If an optional role is provided, the result is
limited to that role. The sublist returned will be in the form of role-name,
schema-name, table-name and then a string containing all the rights of that role
on that table in that schema.
</p>
</div>
</div>
</div>
<div id="outline-container-database-information" class="outline-2">
<h2 id="database-information">Database Information</h2>
<div class="outline-text-2" id="text-database-information">
</div>
<div id="outline-container-funciton-add-comment" class="outline-3">
<h3 id="funciton-add-comment">function add-comment (type name comment &amp;optional (second-name ""))</h3>
<div class="outline-text-3" id="text-funciton-add-comment">
<p>
Attempts to add a comment to a particular database object. The first parameter is a keyword for the type of database object. The second parameter is the name of the object. The third parameter is the comment itself. Some objects require an additional identifier. The names can be strings or symbols.
</p>

<p>
Example usage would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(add-comment <span style="color: #23d7d7;">:database</span> 'my-database-name <span style="color: #e67128;">"Does anyone actually use this database?"</span>)

(add-comment <span style="color: #23d7d7;">:column</span> 'country-locations.name <span style="color: #e67128;">"Is what it looks like - the name of a country"</span>)

(add-comment <span style="color: #23d7d7;">:column</span> <span style="color: #e67128;">"country_locations.name"</span> <span style="color: #e67128;">"Is what it looks like - the name of a country"</span>)
</pre>
</div>

<p>
Example usage where two identifiers are required would be constraints:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(add-comment <span style="color: #23d7d7;">:constraint</span> 'constraint1  <span style="color: #e67128;">"Some kind of constraint descriptions here"</span>
             'country-locations)
</pre>
</div>
</div>
</div>

<div id="outline-container-function-find-comments" class="outline-3">
<h3 id="function-find-comments">find-comments (type identifier)</h3>
<div class="outline-text-3" id="text-function-find-comments">
<p>
Returns the comments attached to a particular database object. The allowed
types are :database :schema :table :columns (all the columns in a table)
:column (for a single column).
</p>

<p>
An example would be (find-comments :table 's2.employees) where the table employees
is in the s2 schema.
</p>
</div>
</div>
