doc/postmodern.org
** function get-database-comment (database-name)
   :PROPERTIES:
   :CUSTOM_ID: function-get-database-comment
   :END:
→ string

Returns the comment, if any, attached to a database. See also get-schema-comment,
get-column-comments and get-database-comment.
** function postgresql-version ()
   :PROPERTIES:
   :CUSTOM_ID: function-postgresql-version
   :END:
→ string

Returns the version string provided by postgresql of the current postgresql
server. E.g. "PostgreSQL 12.2 on x86_64-pc-linux-gnu, compiled by gcc
(Arch Linux 9.3.0-1) 9.3.0, 64-bit". If you want just the postgresql version
number, use (cl-postgres:get-postgresql-version).

** function database-version ()
   :PROPERTIES:
   :CUSTOM_ID: function-database-version
   :END:
→ string

DEPRECATED. This returns the postgresql server version number, not a version
number from the currently connected database. The format of the return string
is determined by the current postgresql server.
E.g. "PostgreSQL 12.2 on x86_64-pc-linux-gnu, compiled by gcc
(Arch Linux 9.3.0-1) 9.3.0, 64-bit".

If you want just the postgresql version
number, use (cl-postgres:get-postgresql-version).

** function current-database ()
   :PROPERTIES:
   :CUSTOM_ID: function-current-databse
   :END:
→ string

Returns the string name of the current database.

** function database-exists-p (database-name)
   :PROPERTIES:
   :CUSTOM_ID: function-database-exists-p
   :END:
→ boolean

Checks to see if a particular database exists. Returns T if true, nil if not.

** function database-size (&optional database-name)
   :PROPERTIES:
   :CUSTOM_ID: function-database-size
   :END:
→ list

Given the name of a database, will return the name, a pretty-print string of
the size of the database and the size in bytes. If a database name is not
provided, it will return the result for the currently connected database.

** function num-records-in-database ()
   :PROPERTIES:
   :CUSTOM_ID: function-num-records-in-database
   :END:
→ list

Returns a list of lists with schema, table name and approximate number of
records in the currently connected database.

** function list-databases (&key (order-by-size nil) (size t))
   :PROPERTIES:
   :CUSTOM_ID: function-list-databases
   :END:
→ list

Returns a list of lists where each sub-list contains the name of the database,
a pretty-print string of the size of that database and the size in bytes. The
default order is by database name. Pass t as a parameter to :order-by-size
for order by size. Setting size to nil will return just the database names
in a single list ordered by name. This function excludes the template databases

** function list-database-functions ()
   :PROPERTIES:
   :CUSTOM_ID: list-database-functions
   :END:
→ list

Returns a list of the functions in the database from the information_schema.

** function list-database-users ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-databse-users
   :END:
→ list

List database users (actually 'roles' in Postgresql terminology).
** function list-database-access-rights (&optional database-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-database-access-rights
   :END:
→ list

If the database parameter is specifed, this returns an list of lists where
each sublist is a role name and whether they have access rights (t or nil) to that
particular database. If the database-name is not provided, the sublist is
a database name, a role name and whether they have access rights (t or nil). This
excludes the template databases.

** function list-available-types ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-available-types
   :END:
→ list

List the available data types in the connected postgresql version, It returns a
list of lists, each sublist containing the oid (object identifier number) and
the name of the data types. E.g. (21 "smallint")

** function list-available-collations ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-available-collations
   :END:
→ list

Get a list of the collations available from the current database cluster.
Collations are a mess as different operating systems provide different
collations. We might get some sanity if Postgresql can use ICU as the default.
See https://wiki.postgresql.org/wiki/Collations.
** function list-available-extensions ()
   :PROPERTIES:
   :CUSTOM_ID: list-available-extensions
   :END:
→ list

List the postgresql extensions which are available in the system to the
currently connected database. The extensions may or may not be installed.
** function list-installed-extensions ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-installed-extensions
   :END:
→ list

List the postgresql extensions which are installed in the currently connected
database.

** function load-uuid-extension ()
   :PROPERTIES:
   :CUSTOM_ID: function-load-uuid-extensin
   :END:

Loads the Postgresql uuid-ossp contrib module. Once loaded, you can call uuid
generation functions such as uuid_generate_v4 within a query. E.g.
#+begin_src lisp
  (query "select uuid_generate_v4()")
#+end_src
It will be skipped if it is already loaded. See Postgresql documentation at https://www.postgresql.org/docs/current/uuid-ossp.htmlList for more details.

** function list-templates ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-templates
   :END:
→ list

Returns a list of existing database template names.
** function change-toplevel-database (new-database user password host)
   :PROPERTIES:
   :CUSTOM_ID: function-change-toplevel-database
   :END:
→ string

Just changes the database assuming you are using a toplevel connection.
Recommended only for development work. Returns the name of the newly connected
database as a string.

** function cache-hit-ratio ()
   :PROPERTIES:
   :CUSTOM_ID: function-cache-hit-ratio
   :END:
→ list

The cache hit ratio shows data on serving the data from memory compared to how
often you have to go to disk. This function returns a list of heapblocks read
from disk, heapblocks hit from memory and the ratio of heapblocks hit from
memory / total heapblocks hit. Borrowed from: https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/

