doc/postmodern.html
<div id="outline-container-function-get-database-comment" class="outline-3">
<h3 id="function-get-database-comment">function get-database-comment (database-name)</h3>
<div class="outline-text-3" id="text-function-get-database-comment">
<p>
→ string
</p>

<p>
Returns the comment, if any, attached to a database. See also get-schema-comment,
get-column-comments and get-database-comment.
</p>
</div>
</div>
<div id="outline-container-function-postgresql-version" class="outline-3">
<h3 id="function-postgresql-version">function postgresql-version ()</h3>
<div class="outline-text-3" id="text-function-postgresql-version">
<p>
→ string
</p>

<p>
Returns the version string provided by postgresql of the current postgresql
server. E.g. "PostgreSQL 12.2 on x86_64-pc-linux-gnu, compiled by gcc
(Arch Linux 9.3.0-1) 9.3.0, 64-bit". If you want just the postgresql version
number, use (cl-postgres:get-postgresql-version).
</p>
</div>
</div>

<div id="outline-container-function-database-version" class="outline-3">
<h3 id="function-database-version">function database-version ()</h3>
<div class="outline-text-3" id="text-function-database-version">
<p>
→ string
</p>

<p>
DEPRECATED. This returns the postgresql server version number, not a version
number from the currently connected database. The format of the return string
is determined by the current postgresql server.
E.g. "PostgreSQL 12.2 on x86_64-pc-linux-gnu, compiled by gcc
(Arch Linux 9.3.0-1) 9.3.0, 64-bit".
</p>

<p>
If you want just the postgresql version
number, use (cl-postgres:get-postgresql-version).
</p>
</div>
</div>

<div id="outline-container-function-current-databse" class="outline-3">
<h3 id="function-current-databse">function current-database ()</h3>
<div class="outline-text-3" id="text-function-current-databse">
<p>
→ string
</p>

<p>
Returns the string name of the current database.
</p>
</div>
</div>

<div id="outline-container-function-database-exists-p" class="outline-3">
<h3 id="function-database-exists-p">function database-exists-p (database-name)</h3>
<div class="outline-text-3" id="text-function-database-exists-p">
<p>
→ boolean
</p>

<p>
Checks to see if a particular database exists. Returns T if true, nil if not.
</p>
</div>
</div>

<div id="outline-container-function-database-size" class="outline-3">
<h3 id="function-database-size">function database-size (&amp;optional database-name)</h3>
<div class="outline-text-3" id="text-function-database-size">
<p>
→ list
</p>

<p>
Given the name of a database, will return the name, a pretty-print string of
the size of the database and the size in bytes. If a database name is not
provided, it will return the result for the currently connected database.
</p>
</div>
</div>

<div id="outline-container-function-num-records-in-database" class="outline-3">
<h3 id="function-num-records-in-database">function num-records-in-database ()</h3>
<div class="outline-text-3" id="text-function-num-records-in-database">
<p>
→ list
</p>

<p>
Returns a list of lists with schema, table name and approximate number of
records in the currently connected database.
</p>
</div>
</div>

<div id="outline-container-function-list-databases" class="outline-3">
<h3 id="function-list-databases">function list-databases (&amp;key (order-by-size nil) (size t))</h3>
<div class="outline-text-3" id="text-function-list-databases">
<p>
→ list
</p>

<p>
Returns a list of lists where each sub-list contains the name of the database,
a pretty-print string of the size of that database and the size in bytes. The
default order is by database name. Pass t as a parameter to :order-by-size
for order by size. Setting size to nil will return just the database names
in a single list ordered by name. This function excludes the template databases
</p>
</div>
</div>

<div id="outline-container-list-database-functions" class="outline-3">
<h3 id="list-database-functions">function list-database-functions ()</h3>
<div class="outline-text-3" id="text-list-database-functions">
<p>
→ list
</p>

<p>
Returns a list of the functions in the database from the information_schema.
</p>
</div>
</div>

<div id="outline-container-function-list-databse-users" class="outline-3">
<h3 id="function-list-databse-users">function list-database-users ()</h3>
<div class="outline-text-3" id="text-function-list-databse-users">
<p>
→ list
</p>

<p>
List database users (actually 'roles' in Postgresql terminology).
</p>
</div>
</div>
<div id="outline-container-function-list-database-access-rights" class="outline-3">
<h3 id="function-list-database-access-rights">function list-database-access-rights (&amp;optional database-name)</h3>
<div class="outline-text-3" id="text-function-list-database-access-rights">
<p>
→ list
</p>

<p>
If the database parameter is specifed, this returns an list of lists where
each sublist is a role name and whether they have access rights (t or nil) to that
particular database. If the database-name is not provided, the sublist is
a database name, a role name and whether they have access rights (t or nil). This
excludes the template databases.
</p>
</div>
</div>

<div id="outline-container-function-list-available-types" class="outline-3">
<h3 id="function-list-available-types">function list-available-types ()</h3>
<div class="outline-text-3" id="text-function-list-available-types">
<p>
→ list
</p>

<p>
List the available data types in the connected postgresql version, It returns a
list of lists, each sublist containing the oid (object identifier number) and
the name of the data types. E.g. (21 "smallint")
</p>
</div>
</div>

<div id="outline-container-function-list-available-collations" class="outline-3">
<h3 id="function-list-available-collations">function list-available-collations ()</h3>
<div class="outline-text-3" id="text-function-list-available-collations">
<p>
→ list
</p>

<p>
Get a list of the collations available from the current database cluster.
Collations are a mess as different operating systems provide different
collations. We might get some sanity if Postgresql can use ICU as the default.
See <a href="https://wiki.postgresql.org/wiki/Collations">https://wiki.postgresql.org/wiki/Collations</a>.
</p>
</div>
</div>
<div id="outline-container-list-available-extensions" class="outline-3">
<h3 id="list-available-extensions">function list-available-extensions ()</h3>
<div class="outline-text-3" id="text-list-available-extensions">
<p>
→ list
</p>

<p>
List the postgresql extensions which are available in the system to the
currently connected database. The extensions may or may not be installed.
</p>
</div>
</div>
<div id="outline-container-function-list-installed-extensions" class="outline-3">
<h3 id="function-list-installed-extensions">function list-installed-extensions ()</h3>
<div class="outline-text-3" id="text-function-list-installed-extensions">
<p>
→ list
</p>

<p>
List the postgresql extensions which are installed in the currently connected
database.
</p>
</div>
</div>

<div id="outline-container-function-load-uuid-extensin" class="outline-3">
<h3 id="function-load-uuid-extensin">function load-uuid-extension ()</h3>
<div class="outline-text-3" id="text-function-load-uuid-extensin">
<p>
Loads the Postgresql uuid-ossp contrib module. Once loaded, you can call uuid
generation functions such as uuid_generate_v4 within a query. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select uuid_generate_v4()"</span>)
</pre>
</div>
<p>
It will be skipped if it is already loaded. See Postgresql documentation at <a href="https://www.postgresql.org/docs/current/uuid-ossp.htmlList">https://www.postgresql.org/docs/current/uuid-ossp.htmlList</a> for more details.
</p>
</div>
</div>

<div id="outline-container-function-list-templates" class="outline-3">
<h3 id="function-list-templates">function list-templates ()</h3>
<div class="outline-text-3" id="text-function-list-templates">
<p>
→ list
</p>

<p>
Returns a list of existing database template names.
</p>
</div>
</div>
<div id="outline-container-function-change-toplevel-database" class="outline-3">
<h3 id="function-change-toplevel-database">function change-toplevel-database (new-database user password host)</h3>
<div class="outline-text-3" id="text-function-change-toplevel-database">
<p>
→ string
</p>

<p>
Just changes the database assuming you are using a toplevel connection.
Recommended only for development work. Returns the name of the newly connected
database as a string.
</p>
</div>
</div>

<div id="outline-container-function-cache-hit-ratio" class="outline-3">
<h3 id="function-cache-hit-ratio">function cache-hit-ratio ()</h3>
<div class="outline-text-3" id="text-function-cache-hit-ratio">
<p>
→ list
</p>

<p>
The cache hit ratio shows data on serving the data from memory compared to how
often you have to go to disk. This function returns a list of heapblocks read
from disk, heapblocks hit from memory and the ratio of heapblocks hit from
memory / total heapblocks hit. Borrowed from: <a href="https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/">https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/</a>
</p>
</div>
</div>
