doc/postmodern.org
** function bloat-measurement ()
   :PROPERTIES:
   :CUSTOM_ID: function-bloat-measurement
   :END:
→ list

Bloat measurement of unvacuumed dead tuples.
Borrowed from: https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/ who
borrowed it from https://github.com/heroku/heroku-pg-extras/tree/master/commands.

** function unused-indexes ()
   :PROPERTIES:
   :CUSTOM_ID: function-unused-indexes
   :END:
→ list

Returns a list of lists showing schema.table, indexname, index_size and number
of scans. The code was borrowed from: https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/

** function check-query-performance (&optional (ob nil) (num-calls 100) (limit 20))
   :PROPERTIES:
   :CUSTOM_ID: function-check-query-performance
   :END:
→ list

This function requires that postgresql extension pg_stat_statements must be
loaded via shared_preload_libraries. It is borrowed from https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/.
Optional parameters:

 OB allow order-by to be 'calls', 'total-time', 'rows-per'
or 'time-per', defaulting to time-per.

num-calls to require that the number of calls exceeds a certain threshold, and
limit to limit the number of rows returned. It returns a list of lists, each
row containing the query, number of calls, total_time, total_time/calls,
stddev_time, rows, rows/calls and the cache hit percentage.

* Constraints
  :PROPERTIES:
  :CUSTOM_ID: constraints
  :END:
** function list-unique-or-primary-constraints (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-unique-or-primary-constraints
   :END:
→ list

List constraints on a table. Table-name can be either a string or quoted. Turns
constraints into keywords if strings-p is not true.

** function list-all-constraints (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-all-constraints
   :END:
→ list

Users information_schema to list all the constraints in a table. Table-name can
be either a string or quoted. Turns constraints into keywords if strings-p is
not true.

** function describe-constraint (table-name constraint-name)
   :PROPERTIES:
   :CUSTOM_ID: function-describe-constraint
   :END:
→ list

Return a list of alists of the descriptions a particular constraint given the
table-name and the constraint name using the information_schema table.

** function describe-foreign-key-constraints ()
   :PROPERTIES:
   :CUSTOM_ID: function-describe-foreign-key-constraints
   :END:
→ list

Generates a list of lists of information on the foreign key constraints
* Indexes/Indices
  :PROPERTIES:
  :CUSTOM_ID: indexes
  :END:
** function create-index (name  &key unique if-not-exists concurrently on using fields)
   :PROPERTIES:
   :CUSTOM_ID: function-create-index
   :END:

Create an index. Slightly less sophisticated than the query version because it
does not have a where clause capability.

** function drop-index (name &key concurrently if-exists cascade)
   :PROPERTIES:
   :CUSTOM_ID: function-drop-index
   :END:

Drop an index. Available keys are :concurrently, :if-exists, and :cascade.

** function list-indices (&optional strings-p)
   :PROPERTIES:
   :CUSTOM_ID: function-list-indices
   :END:
→ list

Return a list of the indexs in a database. Turn them into keywords if strings-p
is not true.

** function list-table-indices (table-name &optional strings-p)
   :PROPERTIES:
   :CUSTOM_ID: function-list-table-indices
   :END:
→ list

List the index names and the related columns in a single table. Each index will
be in a separate sublist.

** function index-exists-p (name)
   :PROPERTIES:
   :CUSTOM_ID: function-index-exists-p
   :END:
→ boolean

Tests whether an index with the given name exists. The name can be either a
string or a symbol.

** function list-indexed-column-and-attributes (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-indexed-column-and-attribute
   :END:
→ list

List the indexed columns and their attributes in a table. Includes primary
key.

** function list-index-definitions (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-index-definitions
   :END:
→ list

Returns a list of the definitions used to create the current indexes for
the table

* Keys
  :PROPERTIES:
  :CUSTOM_ID: keys
  :END:
** function find-primary-key-info (table-name &optional (just-key nil))
   :PROPERTIES:
   :CUSTOM_ID: function-find-primary-key-info
   :END:
→ list

Returns a list of sublists where the sublist contains two strings. If a table
primary key consists of only one column, such as 'id' there will be a single
sublist where the first string is the name of the column and the second string
is the string name for the datatype for that column. If the primary key for the
table consists of more than one column, there will be a sublist for each column
subpart of the key. The sublists will be in the order they are used in the key,
not in the order they appear in the table. If just-key is set to t, the list
being returned will contain just the column names in the primary key as string
names with no sublists. If the table is not in the public schema, provide the
fully qualified table name e.g. schema-name.table-name.

** function list-foreign-keys (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-foreign-keys
   :END:
→ list

Returns a list of sublists of foreign key info in the form of
   '((constraint-name local-table local-table-column
     foreign-table-name foreign-column-name))

* Schema/Schemata
  :PROPERTIES:
  :CUSTOM_ID: schema
  :END:
Schema allow you to separate tables into differnet name spaces. In different
schemata two tables with the same name are allowed to exists. The tables can
be referred by fully qualified names or with the macro with-schema. You could
also set the search path with set-search-path. For listing end checking there
are also the functions list-schemata and schema-exist-p. The following
functions allow you to create, drop schemata and to set the search path.

