doc/postmodern.html

<div id="outline-container-function-bloat-measurement" class="outline-3">
<h3 id="function-bloat-measurement">function bloat-measurement ()</h3>
<div class="outline-text-3" id="text-function-bloat-measurement">
<p>
→ list
</p>

<p>
Bloat measurement of unvacuumed dead tuples.
Borrowed from: <a href="https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/">https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/</a> who
borrowed it from <a href="https://github.com/heroku/heroku-pg-extras/tree/master/commands">https://github.com/heroku/heroku-pg-extras/tree/master/commands</a>.
</p>
</div>
</div>

<div id="outline-container-function-unused-indexes" class="outline-3">
<h3 id="function-unused-indexes">function unused-indexes ()</h3>
<div class="outline-text-3" id="text-function-unused-indexes">
<p>
→ list
</p>

<p>
Returns a list of lists showing schema.table, indexname, index_size and number
of scans. The code was borrowed from: <a href="https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/">https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/</a>
</p>
</div>
</div>

<div id="outline-container-function-check-query-performance" class="outline-3">
<h3 id="function-check-query-performance">function check-query-performance (&amp;optional (ob nil) (num-calls 100) (limit 20))</h3>
<div class="outline-text-3" id="text-function-check-query-performance">
<p>
→ list
</p>

<p>
This function requires that postgresql extension pg_stat_statements must be
loaded via shared_preload_libraries. It is borrowed from <a href="https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/">https://www.citusdata.com/blog/2019/03/29/health-checks-for-your-postgres-database/</a>.
Optional parameters:
</p>

<p>
 OB allow order-by to be 'calls', 'total-time', 'rows-per'
or 'time-per', defaulting to time-per.
</p>

<p>
num-calls to require that the number of calls exceeds a certain threshold, and
limit to limit the number of rows returned. It returns a list of lists, each
row containing the query, number of calls, total_time, total_time/calls,
stddev_time, rows, rows/calls and the cache hit percentage.
</p>
</div>
</div>
</div>

<div id="outline-container-constraints" class="outline-2">
<h2 id="constraints">Constraints</h2>
<div class="outline-text-2" id="text-constraints">
</div>
<div id="outline-container-function-list-unique-or-primary-constraints" class="outline-3">
<h3 id="function-list-unique-or-primary-constraints">function list-unique-or-primary-constraints (table-name)</h3>
<div class="outline-text-3" id="text-function-list-unique-or-primary-constraints">
<p>
→ list
</p>

<p>
List constraints on a table. Table-name can be either a string or quoted. Turns
constraints into keywords if strings-p is not true.
</p>
</div>
</div>

<div id="outline-container-function-list-all-constraints" class="outline-3">
<h3 id="function-list-all-constraints">function list-all-constraints (table-name)</h3>
<div class="outline-text-3" id="text-function-list-all-constraints">
<p>
→ list
</p>

<p>
Users information_schema to list all the constraints in a table. Table-name can
be either a string or quoted. Turns constraints into keywords if strings-p is
not true.
</p>
</div>
</div>

<div id="outline-container-function-describe-constraint" class="outline-3">
<h3 id="function-describe-constraint">function describe-constraint (table-name constraint-name)</h3>
<div class="outline-text-3" id="text-function-describe-constraint">
<p>
→ list
</p>

<p>
Return a list of alists of the descriptions a particular constraint given the
table-name and the constraint name using the information_schema table.
</p>
</div>
</div>

<div id="outline-container-function-describe-foreign-key-constraints" class="outline-3">
<h3 id="function-describe-foreign-key-constraints">function describe-foreign-key-constraints ()</h3>
<div class="outline-text-3" id="text-function-describe-foreign-key-constraints">
<p>
→ list
</p>

<p>
Generates a list of lists of information on the foreign key constraints
</p>
</div>
</div>
</div>
<div id="outline-container-indexes" class="outline-2">
<h2 id="indexes">Indexes/Indices</h2>
<div class="outline-text-2" id="text-indexes">
</div>
<div id="outline-container-function-create-index" class="outline-3">
<h3 id="function-create-index">function create-index (name  &amp;key unique if-not-exists concurrently on using fields)</h3>
<div class="outline-text-3" id="text-function-create-index">
<p>
Create an index. Slightly less sophisticated than the query version because it
does not have a where clause capability.
</p>
</div>
</div>

<div id="outline-container-function-drop-index" class="outline-3">
<h3 id="function-drop-index">function drop-index (name &amp;key concurrently if-exists cascade)</h3>
<div class="outline-text-3" id="text-function-drop-index">
<p>
Drop an index. Available keys are :concurrently, :if-exists, and :cascade.
</p>
</div>
</div>

<div id="outline-container-function-list-indices" class="outline-3">
<h3 id="function-list-indices">function list-indices (&amp;optional strings-p)</h3>
<div class="outline-text-3" id="text-function-list-indices">
<p>
→ list
</p>

<p>
Return a list of the indexs in a database. Turn them into keywords if strings-p
is not true.
</p>
</div>
</div>

<div id="outline-container-function-list-table-indices" class="outline-3">
<h3 id="function-list-table-indices">function list-table-indices (table-name &amp;optional strings-p)</h3>
<div class="outline-text-3" id="text-function-list-table-indices">
<p>
→ list
</p>

<p>
List the index names and the related columns in a single table. Each index will
be in a separate sublist.
</p>
</div>
</div>

<div id="outline-container-function-index-exists-p" class="outline-3">
<h3 id="function-index-exists-p">function index-exists-p (name)</h3>
<div class="outline-text-3" id="text-function-index-exists-p">
<p>
→ boolean
</p>

<p>
Tests whether an index with the given name exists. The name can be either a
string or a symbol.
</p>
</div>
</div>

<div id="outline-container-function-list-indexed-column-and-attribute" class="outline-3">
<h3 id="function-list-indexed-column-and-attribute">function list-indexed-column-and-attributes (table-name)</h3>
<div class="outline-text-3" id="text-function-list-indexed-column-and-attribute">
<p>
→ list
</p>

<p>
List the indexed columns and their attributes in a table. Includes primary
key.
</p>
</div>
</div>

<div id="outline-container-function-list-index-definitions" class="outline-3">
<h3 id="function-list-index-definitions">function list-index-definitions (table-name)</h3>
<div class="outline-text-3" id="text-function-list-index-definitions">
<p>
→ list
</p>

<p>
Returns a list of the definitions used to create the current indexes for
the table
</p>
</div>
</div>
</div>

<div id="outline-container-keys" class="outline-2">
<h2 id="keys">Keys</h2>
<div class="outline-text-2" id="text-keys">
</div>
<div id="outline-container-function-find-primary-key-info" class="outline-3">
<h3 id="function-find-primary-key-info">function find-primary-key-info (table-name &amp;optional (just-key nil))</h3>
<div class="outline-text-3" id="text-function-find-primary-key-info">
<p>
→ list
</p>

<p>
Returns a list of sublists where the sublist contains two strings. If a table
primary key consists of only one column, such as 'id' there will be a single
sublist where the first string is the name of the column and the second string
is the string name for the datatype for that column. If the primary key for the
table consists of more than one column, there will be a sublist for each column
subpart of the key. The sublists will be in the order they are used in the key,
not in the order they appear in the table. If just-key is set to t, the list
being returned will contain just the column names in the primary key as string
names with no sublists. If the table is not in the public schema, provide the
fully qualified table name e.g. schema-name.table-name.
</p>
</div>
</div>

<div id="outline-container-function-list-foreign-keys" class="outline-3">
<h3 id="function-list-foreign-keys">function list-foreign-keys (table-name)</h3>
<div class="outline-text-3" id="text-function-list-foreign-keys">
<p>
→ list
</p>

<p>
Returns a list of sublists of foreign key info in the form of
   '((constraint-name local-table local-table-column
     foreign-table-name foreign-column-name))
</p>
</div>
</div>
</div>

<div id="outline-container-schema" class="outline-2">
<h2 id="schema">Schema/Schemata</h2>
<div class="outline-text-2" id="text-schema">
<p>
Schema allow you to separate tables into differnet name spaces. In different
schemata two tables with the same name are allowed to exists. The tables can
be referred by fully qualified names or with the macro with-schema. You could
also set the search path with set-search-path. For listing end checking there
are also the functions list-schemata and schema-exist-p. The following
functions allow you to create, drop schemata and to set the search path.
</p>
</div>
