doc/postmodern.org
** macro with-schema ((namespace &key :strict t :if-not-exist :create :drop-after) &body body)
   :PROPERTIES:
   :CUSTOM_ID: macro-with-schema
   :END:

A macro to set the schema search path (namespace) of the postgresql database to
include as first entry a specified schema and then executes the body. Before
executing body the PostgreSQL's session variable search_path is set to the given
namespace. After executing body the search_path variable is restored to the
original value.

   Calling with :strict 't only the specified schema is set as current search
path. All other schema are then not searched any more. If strict is nil, the
namespace is just first schema on the search path upon the the body execution.

   Calling with :if-not-exist set to :create the schema is created if this
schema did not exist.

   Calling with :if-not-exist set to nil, an error is signaled.

   calling with drop-after set to 't the schema is removed after the execution
of the body form.

   example :
     (with-schema (:schema-name :strict nil :drop-after nil :if-not-exist :error)
            (foo 1)
            (foo 2))

   example :
     (with-schema ('uniq :if-not-exist :create) ;; changing the search path
            (schema-exists-p 'uniq))

** function list-schemata ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-schemata
   :END:
→ list

List all existing user defined schemata.

Note: The query uses the portable information_schema relations instead of
pg_tables relations.
#+BEGIN_SRC sql
select schema_name
from information_schema.schemata
where schema_name !~ '(pg_*)|information_schema'
order by schema_name ;
#+END_SRC

** function list-schemas ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-schemas
   :END:
→ list

List schemas in the current database, excluding the pg_* system schemas.

** function schema-exists-p (schema)
   :PROPERTIES:
   :CUSTOM_ID: function-schema-exists-p
   :END:
→ boolean

Tests the existence of a given schema. Returns T if the schema exists or NIL
otherwise. The name provided can be either a string or quoted symbol.

** function create-schema (schema)
   :PROPERTIES:
   :CUSTOM_ID: function-create-schema
   :END:

Creates a new schema. Raises an error if the schema is already exists.

** function drop-schema (schema &key (if-exists nil) (cascade nil))
   :PROPERTIES:
   :CUSTOM_ID: function-drop-schema
   :END:

Drops an existing database schema. Accepts :if-exists and/or :cascade arguments
like :drop-table. A notice instead of an error is raised with the is-exists
parameter.

** function get-search-path ()
   :PROPERTIES:
   :CUSTOM_ID: function-get-search-path
   :END:

Returns the default schema search path (which schemas are checked first) for the current session.

** function set-search-path (path)
   :PROPERTIES:
   :CUSTOM_ID: function-set-search-path
   :END:

This changes the postgresql runtime parameter controlling what order schemas are
searched. You can always use fully qualified names [schema.table]. By default,
this function only changes the search path for the current session. This
function is used by with-schema.
** function split-fully-qualified-tablename (name)
   :PROPERTIES:
   :CUSTOM_ID: function-split-fully-qualified-tablename
   :END:
→ list
Take a tablename of the form database.schema.table or schema.table or table and
return the tablename and the schema name. The name can be a symbol or a string.
Returns a list of form '(table schema database. If the tablename is not fully
qualified, it will assume that the schema should be \"public\".

** function get-schema-comment (schema-name)
   :PROPERTIES:
   :CUSTOM_ID: function-get-schema-comment
   :END:
→ string

Retrieves the comment, if any attached to the schema. See also get-schema-comment,
get-column-comments and get-database-comment.
* Sequences
  :PROPERTIES:
  :CUSTOM_ID: sequences
  :END:
** function create-sequence (name &key temp if-not-exists increment min-value max-value start cache)
   :PROPERTIES:
   :CUSTOM_ID: function-create-sequence
   :END:

  Create a sequence. Available additional key parameters
are :temp :if-not-exists :increment :min-value :max-value :start and :cache. See
https://www.postgresql.org/docs/current/static/sql-createsequence.html for
details on usage.

** function sequence-next (sequence)
   :PROPERTIES:
   :CUSTOM_ID: function-sequence-next
   :END:
→ integer

Shortcut for getting the next value from a sequence. The sequence identifier can
be either a string or a symbol, in the latter case it will be converted to a
string according to S-SQL rules.

** function drop-sequence (name &key if-exists cascade)
   :PROPERTIES:
   :CUSTOM_ID: function-drop-sequence
   :END:
→ list

Drop a sequence. Name should be quoted. Available key parameters are :if-exists
and :cascade.

** function list-sequences (&optional strings-p)
   :PROPERTIES:
   :CUSTOM_ID: function-list-sequences
   :END:
→ list

Returns a list of the sequences in the current database. When strings-p is T,
the names will be given as strings, otherwise as keywords.

** function sequence-exists-p (name)
   :PROPERTIES:
   :CUSTOM_ID: function-sequence-exists-p
   :END:
→ boolean

Tests  whether a sequence with the given name exists. The name can be either a
string or a symbol.

* Tables
  :PROPERTIES:
  :CUSTOM_ID: tables
  :END:
** function list-tables (&optional strings-p)
   :PROPERTIES:
   :CUSTOM_ID: function-list-tables
   :END:
→ list

DEPRECATED FOR LIST-ALL-TABLES. Return a list of the tables in the public schema
of a database. By default the table names are returned as keywords. They will be
returned as lowercase strings if strings-p is true.

** function list-all-tables (&optional (fully-qualified-names-only nil))
   :PROPERTIES:
   :CUSTOM_ID: function-list-all-tables
   :END:
→ list

If fully-qualified-names-only is set to t, returns a flattened list of all
schema.table names other than pg_catalog or the information_schema.

Otherwise returns the following info:

schema-name, table-name, table-owner, tablespace, hasindexes, hasrules, hastriggers
and rowsecurity(&optional strings-p).

