doc/postmodern.html

<div id="outline-container-macro-with-schema" class="outline-3">
<h3 id="macro-with-schema">macro with-schema ((namespace &amp;key :strict t :if-not-exist :create :drop-after) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-with-schema">
<p>
A macro to set the schema search path (namespace) of the postgresql database to
include as first entry a specified schema and then executes the body. Before
executing body the PostgreSQL's session variable search_path is set to the given
namespace. After executing body the search_path variable is restored to the
original value.
</p>

<p>
   Calling with :strict 't only the specified schema is set as current search
path. All other schema are then not searched any more. If strict is nil, the
namespace is just first schema on the search path upon the the body execution.
</p>

<p>
   Calling with :if-not-exist set to :create the schema is created if this
schema did not exist.
</p>

<p>
Calling with :if-not-exist set to nil, an error is signaled.
</p>

<p>
   calling with drop-after set to 't the schema is removed after the execution
of the body form.
</p>

<p>
example :
  (with-schema (:schema-name :strict nil :drop-after nil :if-not-exist :error)
         (foo 1)
         (foo 2))
</p>

<p>
example :
  (with-schema ('uniq :if-not-exist :create) ;; changing the search path
         (schema-exists-p 'uniq))
</p>
</div>
</div>

<div id="outline-container-function-list-schemata" class="outline-3">
<h3 id="function-list-schemata">function list-schemata ()</h3>
<div class="outline-text-3" id="text-function-list-schemata">
<p>
→ list
</p>

<p>
List all existing user defined schemata.
</p>

<p>
Note: The query uses the portable information_schema relations instead of
pg_tables relations.
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #ffad29; font-weight: bold;">select</span> <span style="color: #ffad29; font-weight: bold;">schema_name</span>
<span style="color: #ffad29; font-weight: bold;">from</span> information_schema.schemata
<span style="color: #ffad29; font-weight: bold;">where</span> <span style="color: #ffad29; font-weight: bold;">schema_name</span> !~ <span style="color: #e67128;">'(pg_*)|information_schema'</span>
<span style="color: #ffad29; font-weight: bold;">order</span> <span style="color: #ffad29; font-weight: bold;">by</span> <span style="color: #ffad29; font-weight: bold;">schema_name</span> ;
</pre>
</div>
</div>
</div>

<div id="outline-container-function-list-schemas" class="outline-3">
<h3 id="function-list-schemas">function list-schemas ()</h3>
<div class="outline-text-3" id="text-function-list-schemas">
<p>
→ list
</p>

<p>
List schemas in the current database, excluding the pg_* system schemas.
</p>
</div>
</div>

<div id="outline-container-function-schema-exists-p" class="outline-3">
<h3 id="function-schema-exists-p">function schema-exists-p (schema)</h3>
<div class="outline-text-3" id="text-function-schema-exists-p">
<p>
→ boolean
</p>

<p>
Tests the existence of a given schema. Returns T if the schema exists or NIL
otherwise. The name provided can be either a string or quoted symbol.
</p>
</div>
</div>

<div id="outline-container-function-create-schema" class="outline-3">
<h3 id="function-create-schema">function create-schema (schema)</h3>
<div class="outline-text-3" id="text-function-create-schema">
<p>
Creates a new schema. Raises an error if the schema is already exists.
</p>
</div>
</div>

<div id="outline-container-function-drop-schema" class="outline-3">
<h3 id="function-drop-schema">function drop-schema (schema &amp;key (if-exists nil) (cascade nil))</h3>
<div class="outline-text-3" id="text-function-drop-schema">
<p>
Drops an existing database schema. Accepts :if-exists and/or :cascade arguments
like :drop-table. A notice instead of an error is raised with the is-exists
parameter.
</p>
</div>
</div>

<div id="outline-container-function-get-search-path" class="outline-3">
<h3 id="function-get-search-path">function get-search-path ()</h3>
<div class="outline-text-3" id="text-function-get-search-path">
<p>
Returns the default schema search path (which schemas are checked first) for the current session.
</p>
</div>
</div>

<div id="outline-container-function-set-search-path" class="outline-3">
<h3 id="function-set-search-path">function set-search-path (path)</h3>
<div class="outline-text-3" id="text-function-set-search-path">
<p>
This changes the postgresql runtime parameter controlling what order schemas are
searched. You can always use fully qualified names [schema.table]. By default,
this function only changes the search path for the current session. This
function is used by with-schema.
</p>
</div>
</div>
<div id="outline-container-function-split-fully-qualified-tablename" class="outline-3">
<h3 id="function-split-fully-qualified-tablename">function split-fully-qualified-tablename (name)</h3>
<div class="outline-text-3" id="text-function-split-fully-qualified-tablename">
<p>
→ list
Take a tablename of the form database.schema.table or schema.table or table and
return the tablename and the schema name. The name can be a symbol or a string.
Returns a list of form '(table schema database. If the tablename is not fully
qualified, it will assume that the schema should be \"public\".
</p>
</div>
</div>

<div id="outline-container-function-get-schema-comment" class="outline-3">
<h3 id="function-get-schema-comment">function get-schema-comment (schema-name)</h3>
<div class="outline-text-3" id="text-function-get-schema-comment">
<p>
→ string
</p>

<p>
Retrieves the comment, if any attached to the schema. See also get-schema-comment,
get-column-comments and get-database-comment.
</p>
</div>
</div>
</div>
<div id="outline-container-sequences" class="outline-2">
<h2 id="sequences">Sequences</h2>
<div class="outline-text-2" id="text-sequences">
</div>
<div id="outline-container-function-create-sequence" class="outline-3">
<h3 id="function-create-sequence">function create-sequence (name &amp;key temp if-not-exists increment min-value max-value start cache)</h3>
<div class="outline-text-3" id="text-function-create-sequence">
<p>
  Create a sequence. Available additional key parameters
are :temp :if-not-exists :increment :min-value :max-value :start and :cache. See
<a href="https://www.postgresql.org/docs/current/static/sql-createsequence.html">https://www.postgresql.org/docs/current/static/sql-createsequence.html</a> for
details on usage.
</p>
</div>
</div>

<div id="outline-container-function-sequence-next" class="outline-3">
<h3 id="function-sequence-next">function sequence-next (sequence)</h3>
<div class="outline-text-3" id="text-function-sequence-next">
<p>
→ integer
</p>

<p>
Shortcut for getting the next value from a sequence. The sequence identifier can
be either a string or a symbol, in the latter case it will be converted to a
string according to S-SQL rules.
</p>
</div>
</div>

<div id="outline-container-function-drop-sequence" class="outline-3">
<h3 id="function-drop-sequence">function drop-sequence (name &amp;key if-exists cascade)</h3>
<div class="outline-text-3" id="text-function-drop-sequence">
<p>
→ list
</p>

<p>
Drop a sequence. Name should be quoted. Available key parameters are :if-exists
and :cascade.
</p>
</div>
</div>

<div id="outline-container-function-list-sequences" class="outline-3">
<h3 id="function-list-sequences">function list-sequences (&amp;optional strings-p)</h3>
<div class="outline-text-3" id="text-function-list-sequences">
<p>
→ list
</p>

<p>
Returns a list of the sequences in the current database. When strings-p is T,
the names will be given as strings, otherwise as keywords.
</p>
</div>
</div>

<div id="outline-container-function-sequence-exists-p" class="outline-3">
<h3 id="function-sequence-exists-p">function sequence-exists-p (name)</h3>
<div class="outline-text-3" id="text-function-sequence-exists-p">
<p>
→ boolean
</p>

<p>
Tests  whether a sequence with the given name exists. The name can be either a
string or a symbol.
</p>
</div>
</div>
</div>

<div id="outline-container-tables" class="outline-2">
<h2 id="tables">Tables</h2>
<div class="outline-text-2" id="text-tables">
</div>
<div id="outline-container-function-list-tables" class="outline-3">
<h3 id="function-list-tables">function list-tables (&amp;optional strings-p)</h3>
<div class="outline-text-3" id="text-function-list-tables">
<p>
→ list
</p>

<p>
DEPRECATED FOR LIST-ALL-TABLES. Return a list of the tables in the public schema
of a database. By default the table names are returned as keywords. They will be
returned as lowercase strings if strings-p is true.
</p>
</div>
</div>

<div id="outline-container-function-list-all-tables" class="outline-3">
<h3 id="function-list-all-tables">function list-all-tables (&amp;optional (fully-qualified-names-only nil))</h3>
<div class="outline-text-3" id="text-function-list-all-tables">
<p>
→ list
</p>

<p>
If fully-qualified-names-only is set to t, returns a flattened list of all
schema.table names other than pg_catalog or the information_schema.
</p>

<p>
Otherwise returns the following info:
</p>

<p>
schema-name, table-name, table-owner, tablespace, hasindexes, hasrules, hastriggers
and rowsecurity(&amp;optional strings-p).
</p>
</div>
</div>
