doc/postmodern.org
** function list-tables-in-schema (&optional (schema-name "public") (strings-p nil))
   :PROPERTIES:
   :CUSTOM_ID: function-list-tables-in-schema
   :END:
→ list

Returns a list of tables in a particular schema, defaulting to public. If
schema-name is :all, it will return all the non-system tables in the database
in fully qualified form: e.g. 'public.test_table'. If string-p is t, the names
will be returned as strings with underscores converted to hyphens.

** function list-table-sizes (&key (schema "public") (order-by-size nil) (size t))
   :PROPERTIES:
   :CUSTOM_ID: function-list-table-sizes
   :END:
→ list

Returns a list of lists (table-name, size in 8k pages) of tables in the current
database. Providing a name to the schema parameter will return just the
information for tables in that schema. It defaults to just the tables in the
public schema. Setting schema to nil will return all tables, indexes etc in
the database in descending order of size. This would include system tables, so
there are a lot more than you would expect. If :size is set to nil, it returns
only a flat list of table names. Setting order-by-size to t will return the
result in order of size instead of by table name.

** function table-exists-p (name)
   :PROPERTIES:
   :CUSTOM_ID: function-table-exists-p
   :END:
→ boolean

Check whether a table exists in a particular schema. Defaults to the search
path. Takes either a string or a symbol for the table name. The table-name can
be fully qualified in the form of schema.table-name or
database.schema.table-name. If the schema is specified either in a qualified
table-name or in the optional schema-name parameter, we look directly to the
information schema tables. Otherwise we use the search path which can be
controlled by being within a with-schema form.

** function table-size (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-table-size
   :END:
→ list

Return the size of a given postgresql table in k or m. Table-name can be either
a string or quoted.

** function table-description (name &optional schema-name)
   :PROPERTIES:
   :CUSTOM_ID: function-table-descriptions
   :END:
→ list

Returns a list of the fields in the named table. Each field is represented
by a list of three elements: the field name, the type, and a boolean indicating
whether the field may be NULL.

Table can be either a string or quoted. Table-names can be fully qualified with
the schema or not. If the table-name is not fully qualified and a schema name
is not provided, the table will be assumed to be in the public schema.

** function table-description-plus (table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-table-description-plus
   :END:
→ list

Returns more table info than table-description. Specifically returns
ordinal-position, column-name, data-type, character-maximum-length, modifier,
whether it is not-null and the default value.

Table can be either a string or quoted. Table-names can be fully qualified with
the schema or not. If the table-name is not fully qualified and a schema name
is not provided, the table will be assumed to be in the public schema.

