doc/postmodern.html

<div id="outline-container-function-table-description-menu" class="outline-3">
<h3 id="function-table-description-menu">function table-description-menu (see below)</h3>
<div class="outline-text-3" id="text-function-table-description-menu">
<p>
→ list string list
</p>

<p>
This has the following parameters, all set to t by default:
</p>

<p>
(table-name &amp;key char-max-length data-type-length
                 has-default default-value not-null
                 numeric-precision numeric-scale
                 storage primary primary-key-name
                 unique unique-key-name fkey fkey-name
                 fkey-col-id fkey-table fkey-local-col-id
                 identity generated collation
                 col-comments locally-defined inheritance-count
                stat-collection)
</p>

<p>
Takes a fully qualified table name which can be either a string or a symbol.
</p>

<p>
Returns three values.
</p>

<ol class="org-ol">
<li>A list of plists of each row's parameters. This will always</li>
</ol>
<p>
include :column-name and :data-type-name but all other parameters can be set or unset
and are set by default (set to t).
</p>

<ol class="org-ol">
<li>The comment string attached to the table itself (if any).</li>

<li>A list of the check constraints applied to the rows in the table. See documentation for</li>
</ol>
<p>
list-check-constraints for an example.
</p>

<p>
The available keyword parameters are:
</p>

<ul class="org-ul">
<li>data-type-length (For a fixed-size type, typlen is the number of bytes in the internal representation of the type. But for a variable-length type, typlen is negative. -1 indicates a “varlena” type (one that has a length word), -2 indicates a null-terminated C string.)</li>
<li>char-max-length (Typically used for something like a varchar and shows the maximum length)</li>
<li>has-default (value T if this column has a default value and :NULL if not)</li>
<li>default-value (value is the default value as string. A default of 9.99 will still be a string)</li>
<li>not-null (value is T if the column must have a value or :NULL otherwise)</li>
<li>numeric-precision (value is the total number of digits for a numeric type if that precision was specified)</li>
<li>numeric-scale (value is the number of digits in the fraction part of a numeric type if that scale was specified)</li>
<li>storage (value is the storage setting for a column. Result can be plain, extended, main or external)</li>
<li>primary (value is T if the column is the primary key for the table, :NULL otherwise)</li>
<li>primary-key-name (value is the name of the primary-key itself, not the column, if the column is the primary key for the table, :NULL otherwise)</li>
<li>unique (value is T if the column is subject to a unique key, :NULL otherwise)</li>
<li>unique-key-name (value is the name of the unique-key itself, not the column, applied to the column, :NULL otherwise)</li>
<li>fkey (value is T if the column is a foreign key, :NULL otherwise)</li>
<li>fkey-name (value is the name of the foreign key, :NULL otherwise)</li>
<li>fkey-col-id (value is the column id of the foreign table used as the foreign key. Probably easier to use the Postmodern function list-foreign-keys if you are looking for the name of the columns)</li>
<li>fkey-table (value is the name of the foreign table, :NULL otherwise)</li>
<li>fkey-local-col-id (value is the column id of this column. Probably easier to use the Postmodern function list-foreign-keys if you are looking for the name of the columns involved in the foreign key)</li>
<li>identity (if the column is an identity column, the values can be 'generated always' or 'generated by default'. Otherwise :NULL)</li>
<li>generated (columns can be generated, if this column is generated and stored on disk, the value will be 'stored', otherwise :NULL)</li>
<li>collation (columns with collations which are not the default collation for the database will show that collation here, otherwise :NULL)</li>
<li>col-comments (value is any comment that has been applied to the column, :NULL otherwise)</li>
<li>locally-defined (value is T if locally defined. It might be both locally defined and inherited)</li>
<li>inheritance-count (the number of direct ancestors this column has inherited)</li>
<li>stat-collection (stat-collection returns the value of attstattarget which controls the level of detail of statistics accumulated for this column by ANALYZE. A zero value indicates that no statistics should be collected. A negative value says to use the system default statistics target. The exact meaning of positive values is data type-dependent. For scalar data types, attstattarget is both the target number of most common values to collect, and the target number of histogram bins to create. Attstorage is normally a copy of pg_type.typstorage of this column's type. For TOAST-able data types, this can be altered after column creation to control storage policy.)</li>
</ul>
</div>
</div>

<div id="outline-container-function-list-check-constraints" class="outline-3">
<h3 id="function-list-check-constraints">function list-check-constraints (table-name)</h3>
<div class="outline-text-3" id="text-function-list-check-constraints">
<p>
→ list
</p>

<p>
Takes a fully qualified table name and returns a list of lists of check constraints
where each sublist has the form of (check-constraint-name check)
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'employees2
                      ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)
                            <span style="color: #23d7d7;">:primary-key</span> <span style="color: #e67128;">"generated by default as identity"</span>)
                       (name <span style="color: #23d7d7;">:type</span> (varchar 40) <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>))
                       (birth-date <span style="color: #23d7d7;">:type</span> date <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&gt;</span> 'birth-date <span style="color: #e67128;">"1900-01-01"</span>))
                       (start-date <span style="color: #23d7d7;">:type</span> date <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&gt;</span> 'start-date 'birth-date))
                       (salary <span style="color: #23d7d7;">:type</span> numeric <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&gt;</span> 'salary 0)))))

(list-check-constraints 'employees2)

((<span style="color: #e67128;">"employees2_birth_date_check"</span> <span style="color: #e67128;">"CHECK (birth_date &gt; '1900-01-01'::date)"</span>)
 (<span style="color: #e67128;">"employees2_check"</span> <span style="color: #e67128;">"CHECK (start_date &gt; birth_date)"</span>)
 (<span style="color: #e67128;">"employees2_name_check"</span> <span style="color: #e67128;">"CHECK (name::text &lt;&gt; ''::text)"</span>)
 (<span style="color: #e67128;">"employees2_salary_check"</span> <span style="color: #e67128;">"CHECK (salary &gt; 0::numeric)"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-function-list-columns" class="outline-3">
<h3 id="function-list-columns">function list-columns (table-name)</h3>
<div class="outline-text-3" id="text-function-list-columns">
<p>
→ list
</p>

<p>
Returns a list of strings of just the column names in a table.
Pulls info from the postmodern table-description function rather than directly.
The table-name can be a string or quoted. Any table-name that is not fully
qualified with the schema will be assumed to be in the public schema.
</p>
</div>
</div>

<div id="outline-container-function-list-columns-with-types" class="outline-3">
<h3 id="function-list-columns-with-types">function list-columns-with-types (table-name)</h3>
<div class="outline-text-3" id="text-function-list-columns-with-types">
<p>
→ list
</p>

<p>
Returns a list of (name type) lists for the fields of a table. Returns a list
of strings of just the column names and their sql data types in a table. Pulls
info from the postmodern table-description function rather than directly. The
table-name can be a string or quoted. Any table-name that is not fully qualified
with the schema will be assumed to be in the public schema.
</p>
</div>
</div>

<div id="outline-container-function-column-exists-p" class="outline-3">
<h3 id="function-column-exists-p">function column-exists-p (table-name column-name &amp;optional schema-name)</h3>
<div class="outline-text-3" id="text-function-column-exists-p">
<p>
→ boolean
</p>

<p>
Determine if a particular column exists. Table name and column-name can be
either strings or symbols. If the optional schema name is not given or the
table-name is not fully qualified with a schema name, the schema will be assumed
to be the public schema.
</p>
</div>
</div>
