doc/postmodern.org
** function get-table-oid (table-name &optional schema-name)
   :PROPERTIES:
   :CUSTOM_ID: function-get-table-oid
   :END:
→ integer

Retrieves the oid identifier for a particular table from postgresql. Works
for tables in all schemas.
** function get-table-comment (table-name &optional schema-name)
   :PROPERTIES:
   :CUSTOM_ID: function-get-table-comment
   :END:
→ string

Retrieves the comment, if any attached to the table. See also get-schema-comment,
get-column-comments and get-database-comment
** function get-column-comments (database schema table)
   :PROPERTIES:
   :CUSTOM_ID: function-get-column-comments
   :END:
→ string

Retrieves a list of lists of column names and the comments, if any, attached
to the columns of a table.
** function rename-table (old-name new-name)
   :PROPERTIES:
   :CUSTOM_ID: rename-table
   :END:
→ boolean

Renames a table. Parameters can be strings or symbols. If you are renaming
a table using a fully qualified schema.table-name, you do not need to
specify the schema in the new-name. You cannot use this function to move
tables from one schema to another. Returns t if successful

** function rename-column (table-name old-name new-name)
:PROPERTIES:
:CUSTOM_ID: function-rename-column
:END:
→ boolean

Rename a column in a table. Parameters can be strings or symbols. If the table
is not in the public schema, it needs to be fully qualified - e.g. schema.table.
Returns t if successful
* Tablespaces
  :PROPERTIES:
  :CUSTOM_ID: tablespaces
  :END:
** function list-tablespaces ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-tablespaces
   :END:
→ list

Lists the tablespaces in the currently connected database. What are tablespace
you ask? Per the Postgresql documentation
https://www.postgresql.org/docs/current/manage-ag-tablespaces.html:
Tablespaces in PostgreSQL allow database administrators to define locations in
the file system where the files representing database objects can be stored.
Once created, a tablespace can be referred to by name when creating database
objects.

By using tablespaces, an administrator can control the disk layout of a
PostgreSQL installation. This is useful in at least two ways. First, if the
partition or volume on which the cluster was initialized runs out of space and
cannot be extended, a tablespace can be created on a different partition and
used until the system can be reconfigured.

Second, tablespaces allow an administrator to use knowledge of the usage pattern
of database objects to optimize performance. For example, an index which is very
heavily used can be placed on a very fast, highly available disk, such as an
expensive solid state device. At the same time a table storing archived data
which is rarely used or not performance critical could be stored on a less
expensive, slower disk system.

* Triggers
  :PROPERTIES:
  :CUSTOM_ID: triggers
  :END:
** function describe-triggers ()
   :PROPERTIES:
   :CUSTOM_ID: function-describe-triggers
   :END:
→ list

List detailed information on the triggers from the information_schema table.
** function list-triggers (&optional table-name)
   :PROPERTIES:
   :CUSTOM_ID: function-list-triggers
   :END:
→ list

List distinct trigger names from the information_schema table. Table-name can be
either quoted or string. (A trigger is a specification that the database should
automatically execute a particular function whenever a certain type of operation
is performed. Triggers can be attached to tables (partitioned or not), views,
and foreign tables.
See https://www.postgresql.org/docs/current/trigger-definition.html)

** function list-detailed-triggers ()
   :PROPERTIES:
   :CUSTOM_ID: function-list-detailed-triggers
   :END:
→ list

* Views
  :PROPERTIES:
  :CUSTOM_ID: views
  :END:
** function list-views (&optional strings-p)
   :PROPERTIES:
   :CUSTOM_ID: function-list-views
   :END:
→ list

Returns list of the user defined views in the current database. When strings-p
is T, the names will be returned as strings, otherwise as keywords.

** function view-exists-p (name)
   :PROPERTIES:
   :CUSTOM_ID: function-view-exists-p
   :END:
→ boolean

Tests whether a view with the given name exists. Takes either a string or a
symbol for the view name.

** function describe-views (&optional (schema "public")
   :PROPERTIES:
   :CUSTOM_ID: function-describe-views
   :END:
→ list

Describe the current views in the specified schema. Includes the select
statements used to create the view. Takes an optional schema but defaults to
public schema.

* Miscellaneous Utility Functions
  :PROPERTIES:
  :CUSTOM_ID: misc-utility-functions
  :END:
** function coalesce (&rest arguments)
   :PROPERTIES:
   :CUSTOM_ID: function-coalesce
   :END:
→ value

Returns the first non-NIL, non-NULL (as in :null) argument, or NIL if none are
present. Useful for providing a fall-back value for the result of a query, or,
when given only one argument, for transforming :nulls to NIL.

** function execute-file (filename &optional (print nil))
   :PROPERTIES:
   :CUSTOM_ID: function-execute-file
   :END:
This function will execute sql queries stored in a file. Each sql statement in
the file will be run independently, but if one statement fails, subsequent
query statements will not be run, but any statement prior to the failing
statement will have been commited.

Execute-file allows the sql file to include other sql files, with the
meta-commands \i or  \include which look for a file location relative to your
default pathname (current working directory) or \ir or \include_relative which
look for a file location relative to the initial sql file. If the file is not
found in the expected location, execute-file will look to see if the requested
file is in the other possible location. If that does not work, it will trigger
an error with a restart which allows you to provide a new name for the file.

If you want the standard transction treatment such that all statements succeed
or no statement succeeds, then ensure that the file starts with a "begin
transaction" statement and finishes with an "end transaction" statement. See
the test file test-execute-file-broken-transaction.sql as an example.

For debugging purposes, if the optional print parameter is set to t, format will
print the count of the query and the query to the REPL.

The default setting is to remove sql comments from the file before executing
the sql code. If that causes problems, the remove-comments parameter can be
set to nil.

IMPORTANT NOTE: This utility function assumes that the file containing the sql
queries can be trusted and bypasses the normal postmodern parameterization of
queries.

