doc/postmodern.html

<div id="outline-container-function-get-table-oid" class="outline-3">
<h3 id="function-get-table-oid">function get-table-oid (table-name &amp;optional schema-name)</h3>
<div class="outline-text-3" id="text-function-get-table-oid">
<p>
→ integer
</p>

<p>
Retrieves the oid identifier for a particular table from postgresql. Works
for tables in all schemas.
</p>
</div>
</div>
<div id="outline-container-function-get-table-comment" class="outline-3">
<h3 id="function-get-table-comment">function get-table-comment (table-name &amp;optional schema-name)</h3>
<div class="outline-text-3" id="text-function-get-table-comment">
<p>
→ string
</p>

<p>
Retrieves the comment, if any attached to the table. See also get-schema-comment,
get-column-comments and get-database-comment
</p>
</div>
</div>
<div id="outline-container-function-get-column-comments" class="outline-3">
<h3 id="function-get-column-comments">function get-column-comments (database schema table)</h3>
<div class="outline-text-3" id="text-function-get-column-comments">
<p>
→ string
</p>

<p>
Retrieves a list of lists of column names and the comments, if any, attached
to the columns of a table.
</p>
</div>
</div>
<div id="outline-container-rename-table" class="outline-3">
<h3 id="rename-table">function rename-table (old-name new-name)</h3>
<div class="outline-text-3" id="text-rename-table">
<p>
→ boolean
</p>

<p>
Renames a table. Parameters can be strings or symbols. If you are renaming
a table using a fully qualified schema.table-name, you do not need to
specify the schema in the new-name. You cannot use this function to move
tables from one schema to another. Returns t if successful
</p>
</div>
</div>

<div id="outline-container-function-rename-column" class="outline-3">
<h3 id="function-rename-column">function rename-column (table-name old-name new-name)</h3>
<div class="outline-text-3" id="text-function-rename-column">
<p>
→ boolean
</p>

<p>
Rename a column in a table. Parameters can be strings or symbols. If the table
is not in the public schema, it needs to be fully qualified - e.g. schema.table.
Returns t if successful
</p>
</div>
</div>
</div>
<div id="outline-container-tablespaces" class="outline-2">
<h2 id="tablespaces">Tablespaces</h2>
<div class="outline-text-2" id="text-tablespaces">
</div>
<div id="outline-container-function-list-tablespaces" class="outline-3">
<h3 id="function-list-tablespaces">function list-tablespaces ()</h3>
<div class="outline-text-3" id="text-function-list-tablespaces">
<p>
→ list
</p>

<p>
Lists the tablespaces in the currently connected database. What are tablespace
you ask? Per the Postgresql documentation
<a href="https://www.postgresql.org/docs/current/manage-ag-tablespaces.html">https://www.postgresql.org/docs/current/manage-ag-tablespaces.html</a>:
Tablespaces in PostgreSQL allow database administrators to define locations in
the file system where the files representing database objects can be stored.
Once created, a tablespace can be referred to by name when creating database
objects.
</p>

<p>
By using tablespaces, an administrator can control the disk layout of a
PostgreSQL installation. This is useful in at least two ways. First, if the
partition or volume on which the cluster was initialized runs out of space and
cannot be extended, a tablespace can be created on a different partition and
used until the system can be reconfigured.
</p>

<p>
Second, tablespaces allow an administrator to use knowledge of the usage pattern
of database objects to optimize performance. For example, an index which is very
heavily used can be placed on a very fast, highly available disk, such as an
expensive solid state device. At the same time a table storing archived data
which is rarely used or not performance critical could be stored on a less
expensive, slower disk system.
</p>
</div>
</div>
</div>

<div id="outline-container-triggers" class="outline-2">
<h2 id="triggers">Triggers</h2>
<div class="outline-text-2" id="text-triggers">
</div>
<div id="outline-container-function-describe-triggers" class="outline-3">
<h3 id="function-describe-triggers">function describe-triggers ()</h3>
<div class="outline-text-3" id="text-function-describe-triggers">
<p>
→ list
</p>

<p>
List detailed information on the triggers from the information_schema table.
</p>
</div>
</div>
<div id="outline-container-function-list-triggers" class="outline-3">
<h3 id="function-list-triggers">function list-triggers (&amp;optional table-name)</h3>
<div class="outline-text-3" id="text-function-list-triggers">
<p>
→ list
</p>

<p>
List distinct trigger names from the information_schema table. Table-name can be
either quoted or string. (A trigger is a specification that the database should
automatically execute a particular function whenever a certain type of operation
is performed. Triggers can be attached to tables (partitioned or not), views,
and foreign tables.
See <a href="https://www.postgresql.org/docs/current/trigger-definition.html">https://www.postgresql.org/docs/current/trigger-definition.html</a>)
</p>
</div>
</div>

<div id="outline-container-function-list-detailed-triggers" class="outline-3">
<h3 id="function-list-detailed-triggers">function list-detailed-triggers ()</h3>
<div class="outline-text-3" id="text-function-list-detailed-triggers">
<p>
→ list
</p>
</div>
</div>
</div>

<div id="outline-container-views" class="outline-2">
<h2 id="views">Views</h2>
<div class="outline-text-2" id="text-views">
</div>
<div id="outline-container-function-list-views" class="outline-3">
<h3 id="function-list-views">function list-views (&amp;optional strings-p)</h3>
<div class="outline-text-3" id="text-function-list-views">
<p>
→ list
</p>

<p>
Returns list of the user defined views in the current database. When strings-p
is T, the names will be returned as strings, otherwise as keywords.
</p>
</div>
</div>

<div id="outline-container-function-view-exists-p" class="outline-3">
<h3 id="function-view-exists-p">function view-exists-p (name)</h3>
<div class="outline-text-3" id="text-function-view-exists-p">
<p>
→ boolean
</p>

<p>
Tests whether a view with the given name exists. Takes either a string or a
symbol for the view name.
</p>
</div>
</div>

<div id="outline-container-function-describe-views" class="outline-3">
<h3 id="function-describe-views">function describe-views (&amp;optional (schema "public")</h3>
<div class="outline-text-3" id="text-function-describe-views">
<p>
→ list
</p>

<p>
Describe the current views in the specified schema. Includes the select
statements used to create the view. Takes an optional schema but defaults to
public schema.
</p>
</div>
</div>
</div>

<div id="outline-container-misc-utility-functions" class="outline-2">
<h2 id="misc-utility-functions">Miscellaneous Utility Functions</h2>
<div class="outline-text-2" id="text-misc-utility-functions">
</div>
<div id="outline-container-function-coalesce" class="outline-3">
<h3 id="function-coalesce">function coalesce (&amp;rest arguments)</h3>
<div class="outline-text-3" id="text-function-coalesce">
<p>
→ value
</p>

<p>
Returns the first non-NIL, non-NULL (as in :null) argument, or NIL if none are
present. Useful for providing a fall-back value for the result of a query, or,
when given only one argument, for transforming :nulls to NIL.
</p>
</div>
</div>

<div id="outline-container-function-execute-file" class="outline-3">
<h3 id="function-execute-file">function execute-file (filename &amp;optional (print nil))</h3>
<div class="outline-text-3" id="text-function-execute-file">
<p>
This function will execute sql queries stored in a file. Each sql statement in
the file will be run independently, but if one statement fails, subsequent
query statements will not be run, but any statement prior to the failing
statement will have been commited.
</p>

<p>
Execute-file allows the sql file to include other sql files, with the
meta-commands \i or  \include which look for a file location relative to your
default pathname (current working directory) or \ir or \include_relative which
look for a file location relative to the initial sql file. If the file is not
found in the expected location, execute-file will look to see if the requested
file is in the other possible location. If that does not work, it will trigger
an error with a restart which allows you to provide a new name for the file.
</p>

<p>
If you want the standard transction treatment such that all statements succeed
or no statement succeeds, then ensure that the file starts with a "begin
transaction" statement and finishes with an "end transaction" statement. See
the test file test-execute-file-broken-transaction.sql as an example.
</p>

<p>
For debugging purposes, if the optional print parameter is set to t, format will
print the count of the query and the query to the REPL.
</p>

<p>
The default setting is to remove sql comments from the file before executing
the sql code. If that causes problems, the remove-comments parameter can be
set to nil.
</p>

<p>
IMPORTANT NOTE: This utility function assumes that the file containing the sql
queries can be trusted and bypasses the normal postmodern parameterization of
queries.
</p>
</div>
</div>
