doc/postmodern.org
** function postgres-array-string-to-list (str)
   :PROPERTIES:
   :CUSTOM_ID: function-postgres-array-string-to-list
   :END:
→ array

Takes a postgresql array in the form of a string like
"{wol=CTc/wol,a=c/wol,b=c/wol}" and returns a lisp array like
    #("wol=CTc/wol" "a=c/wol" "b=c/wol")
** function postgres-array-string-to-array (str)
   :PROPERTIES:
   :CUSTOM_ID: function-postgres-array-string-to-array
   :END:
  "Takes a postgresql array in the form of a string like
\"{wol=CTc/wol,a=c/wol,b=c/wol}\" and returns a lisp list like
  (\"wol=CTc/wol\" \"a=c/wol\" \"b=c/wol\")."
* Imported From s-sql
  :PROPERTIES:
  :CUSTOM_ID: imported-from-s-sql
  :END:
** macro sql (form)
   :PROPERTIES:
   :CUSTOM_ID: macro-sql
   :END:
→ string

Convert the given form (a list starting with a keyword) to an SQL query string
at compile time, according to the rules described here. For example:
#+BEGIN_SRC lisp
(sql (:select '* :from 'country :where (:= 'a 1)))
 "(SELECT * FROM country WHERE (a = 1))"
#+END_SRC

but
#+BEGIN_SRC lisp
(sql '(:select '* :from 'country :where (:= 'a 1)))
#+END_SRC

would throw an error. For the later case you need to use sql-compile.

** function sql-compile (form)
   :PROPERTIES:
   :CUSTOM_ID: function-sql-compile
   :END:
→ string

This is the run-time variant of the sql macro. It converts the given list to
an SQL query, with the same rules except that symbols in this list do not
have to be quoted to be interpreted as identifiers. For example:
#+BEGIN_SRC lisp
 (sql-compile '(:select '* :from 'country :where (:= 'a 1)))

  \"(SELECT * FROM country WHERE (a = 1))\"
#+END_SRC

but
#+BEGIN_SRC lisp
(sql (:select '* :from 'country :where (:= 'a 1)))
#+END_SRC
would throw an error. For the later case you need to use sql.

** deftype smallint ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-smallint
   :END:

  '(signed-byte 16)
** deftype bigint ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-bigint
   :END:

  '(signed-byte 64)
** deftype numeric (&optional precision/scale scale)
   :PROPERTIES:
   :CUSTOM_ID: deftype-numeric
   :END:

  (declare (ignore precision/scale scale))
  'number
** deftype double-precision ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-double-precision
   :END:

  'double-float
** deftype bytea ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-bytea
   :END:

  '(array (unsigned-byte 8))
** deftype text ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-text
   :END:

  'string
** deftype varchar (length)
   :PROPERTIES:
   :CUSTOM_ID: deftype-varchar
   :END:

  (declare (ignore length))
  `string)
** deftype serial ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-serial
   :END:

'integer
** deftype serial8 ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-serial8
   :END:

'integer

** deftype db-null ()
   :PROPERTIES:
   :CUSTOM_ID: deftype-db-null
   :END:

Type for representing NULL values. Use like (or integer db-null) for declaring a
type to be an integer that may be null."
  '(eql :null)

** function from-sql-name (str)
   :PROPERTIES:
   :CUSTOM_ID: function-from-sql-name
   :END:

Convert a string to a symbol, upcasing and replacing underscores with hyphens.
** function parse-queries (file-content)
   :PROPERTIES:
   :CUSTOM_ID: function-parse-queries
   :END:
→ list

Read SQL queries in given string and split them, returns a list.
** function read-queries (filename)
   :PROPERTIES:
   :CUSTOM_ID: function-read-queries
   :END:

Read SQL queries in a given file and split them, returns a list. Track included
files so there is no accidental infinite loop. The default setting is to remove
sql comments from the file before executing the sql code. If that causes problems,
the remove-comments parameter can be set to nil.
** function sql-escape-string (string)
   :PROPERTIES:
   :CUSTOM_ID: function-sql-escape-string
   :END:
→ string

[[http://www.postgresql.org/docs/current/static/sql-syntax-lexical.html#SQL-SYNTAX-STRINGS][Escapes]] a string for inclusion in a PostgreSQL query. Example:
#+BEGIN_SRC lisp
 (sql-escape-string \"Puss in 'Boots'\")

 \"E'Puss in ''Boots'''\"

#+END_SRC


** method sql-escape (arg)
   :PROPERTIES:
   :CUSTOM_ID: method-sql-escape
   :END:

A generalisation of sql-escape-string looks at the type of the value passed, and
properly writes it out it for inclusion in an SQL query. Symbols will be
converted to SQL names. Examples:
#+BEGIN_SRC lisp
(sql-escape "tr'-x")

"E'tr''-x'"

(sql-escape (/ 1 13))

"0.0769230769230769230769230769230769230"

(sql-escape #("Baden-Wurttemberg" "Bavaria" "Berlin" "Brandenburg"))

"ARRAY[E'Baden-Wurttemberg', E'Bavaria', E'Berlin', E'Brandenburg']"
#+END_SRC
** macro register-sql-operators (arity &rest names)
   :PROPERTIES:
   :CUSTOM_ID: macro-register-sql-operators
   :END:

Define simple operators. Arity is one of :unary (like
'not'), :unary-postfix (the operator comes after the operand),
:n-ary (like \+ : the operator falls away when there is only one
operand), :2+-ary (like '=', which is meaningless for one operand),
or :n-or-unary (like '-', where the operator is kept in the unary
case). After the arity follow any number of operators, either just a
keyword, in which case the downcased symbol name is used as the
operator, or a two-element list containing a keyword and a name
string.
