doc/postmodern.html

<div id="outline-container-function-postgres-array-string-to-list" class="outline-3">
<h3 id="function-postgres-array-string-to-list">function postgres-array-string-to-list (str)</h3>
<div class="outline-text-3" id="text-function-postgres-array-string-to-list">
<p>
→ array
</p>

<p>
Takes a postgresql array in the form of a string like
"{wol=CTc/wol,a=c/wol,b=c/wol}" and returns a lisp array like
    #("wol=CTc/wol" "a=c/wol" "b=c/wol")
</p>
</div>
</div>
<div id="outline-container-function-postgres-array-string-to-array" class="outline-3">
<h3 id="function-postgres-array-string-to-array">function postgres-array-string-to-array (str)</h3>
<div class="outline-text-3" id="text-function-postgres-array-string-to-array">
<p>
  "Takes a postgresql array in the form of a string like
\"{wol=CTc/wol,a=c/wol,b=c/wol}\" and returns a lisp list like
  (\"wol=CTc/wol\" \"a=c/wol\" \"b=c/wol\")."
</p>
</div>
</div>
</div>
<div id="outline-container-imported-from-s-sql" class="outline-2">
<h2 id="imported-from-s-sql">Imported From s-sql</h2>
<div class="outline-text-2" id="text-imported-from-s-sql">
</div>
<div id="outline-container-macro-sql" class="outline-3">
<h3 id="macro-sql">macro sql (form)</h3>
<div class="outline-text-3" id="text-macro-sql">
<p>
→ string
</p>

<p>
Convert the given form (a list starting with a keyword) to an SQL query string
at compile time, according to the rules described here. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'a 1)))
 <span style="color: #e67128;">"(SELECT * FROM country WHERE (a = 1))"</span>
</pre>
</div>

<p>
but
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql '(<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'a 1)))
</pre>
</div>

<p>
would throw an error. For the later case you need to use sql-compile.
</p>
</div>
</div>

<div id="outline-container-function-sql-compile" class="outline-3">
<h3 id="function-sql-compile">function sql-compile (form)</h3>
<div class="outline-text-3" id="text-function-sql-compile">
<p>
→ string
</p>

<p>
This is the run-time variant of the sql macro. It converts the given list to
an SQL query, with the same rules except that symbols in this list do not
have to be quoted to be interpreted as identifiers. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-compile '(<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'a 1)))

 \"(SELECT * FROM country WHERE (a = 1))\"
</pre>
</div>

<p>
but
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'country <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'a 1)))
</pre>
</div>
<p>
would throw an error. For the later case you need to use sql.
</p>
</div>
</div>

<div id="outline-container-deftype-smallint" class="outline-3">
<h3 id="deftype-smallint">deftype smallint ()</h3>
<div class="outline-text-3" id="text-deftype-smallint">
<p>
'(signed-byte 16)
</p>
</div>
</div>
<div id="outline-container-deftype-bigint" class="outline-3">
<h3 id="deftype-bigint">deftype bigint ()</h3>
<div class="outline-text-3" id="text-deftype-bigint">
<p>
'(signed-byte 64)
</p>
</div>
</div>
<div id="outline-container-deftype-numeric" class="outline-3">
<h3 id="deftype-numeric">deftype numeric (&amp;optional precision/scale scale)</h3>
<div class="outline-text-3" id="text-deftype-numeric">
<p>
(declare (ignore precision/scale scale))
'number
</p>
</div>
</div>
<div id="outline-container-deftype-double-precision" class="outline-3">
<h3 id="deftype-double-precision">deftype double-precision ()</h3>
<div class="outline-text-3" id="text-deftype-double-precision">
<p>
'double-float
</p>
</div>
</div>
<div id="outline-container-deftype-bytea" class="outline-3">
<h3 id="deftype-bytea">deftype bytea ()</h3>
<div class="outline-text-3" id="text-deftype-bytea">
<p>
'(array (unsigned-byte 8))
</p>
</div>
</div>
<div id="outline-container-deftype-text" class="outline-3">
<h3 id="deftype-text">deftype text ()</h3>
<div class="outline-text-3" id="text-deftype-text">
<p>
'string
</p>
</div>
</div>
<div id="outline-container-deftype-varchar" class="outline-3">
<h3 id="deftype-varchar">deftype varchar (length)</h3>
<div class="outline-text-3" id="text-deftype-varchar">
<p>
(declare (ignore length))
`string)
</p>
</div>
</div>
<div id="outline-container-deftype-serial" class="outline-3">
<h3 id="deftype-serial">deftype serial ()</h3>
<div class="outline-text-3" id="text-deftype-serial">
<p>
'integer
</p>
</div>
</div>
<div id="outline-container-deftype-serial8" class="outline-3">
<h3 id="deftype-serial8">deftype serial8 ()</h3>
<div class="outline-text-3" id="text-deftype-serial8">
<p>
'integer
</p>
</div>
</div>

<div id="outline-container-deftype-db-null" class="outline-3">
<h3 id="deftype-db-null">deftype db-null ()</h3>
<div class="outline-text-3" id="text-deftype-db-null">
<p>
Type for representing NULL values. Use like (or integer db-null) for declaring a
type to be an integer that may be null."
  '(eql :null)
</p>
</div>
</div>

<div id="outline-container-function-from-sql-name" class="outline-3">
<h3 id="function-from-sql-name">function from-sql-name (str)</h3>
<div class="outline-text-3" id="text-function-from-sql-name">
<p>
Convert a string to a symbol, upcasing and replacing underscores with hyphens.
</p>
</div>
</div>
<div id="outline-container-function-parse-queries" class="outline-3">
<h3 id="function-parse-queries">function parse-queries (file-content)</h3>
<div class="outline-text-3" id="text-function-parse-queries">
<p>
→ list
</p>

<p>
Read SQL queries in given string and split them, returns a list.
</p>
</div>
</div>
<div id="outline-container-function-read-queries" class="outline-3">
<h3 id="function-read-queries">function read-queries (filename)</h3>
<div class="outline-text-3" id="text-function-read-queries">
<p>
Read SQL queries in a given file and split them, returns a list. Track included
files so there is no accidental infinite loop. The default setting is to remove
sql comments from the file before executing the sql code. If that causes problems,
the remove-comments parameter can be set to nil.
</p>
</div>
</div>
<div id="outline-container-function-sql-escape-string" class="outline-3">
<h3 id="function-sql-escape-string">function sql-escape-string (string)</h3>
<div class="outline-text-3" id="text-function-sql-escape-string">
<p>
→ string
</p>

<p>
<a href="http://www.postgresql.org/docs/current/static/sql-syntax-lexical.html#SQL-SYNTAX-STRINGS">Escapes</a> a string for inclusion in a PostgreSQL query. Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-escape-string \"Puss in 'Boots'\")

\"E'Puss in ''Boots'''\"

</pre>
</div>
</div>
</div>


<div id="outline-container-method-sql-escape" class="outline-3">
<h3 id="method-sql-escape">method sql-escape (arg)</h3>
<div class="outline-text-3" id="text-method-sql-escape">
<p>
A generalisation of sql-escape-string looks at the type of the value passed, and
properly writes it out it for inclusion in an SQL query. Symbols will be
converted to SQL names. Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-escape <span style="color: #e67128;">"tr'-x"</span>)

<span style="color: #e67128;">"E'tr''-x'"</span>

(sql-escape (/ 1 13))

<span style="color: #e67128;">"0.0769230769230769230769230769230769230"</span>

(sql-escape #(<span style="color: #e67128;">"Baden-Wurttemberg"</span> <span style="color: #e67128;">"Bavaria"</span> <span style="color: #e67128;">"Berlin"</span> <span style="color: #e67128;">"Brandenburg"</span>))

<span style="color: #e67128;">"ARRAY[E'Baden-Wurttemberg', E'Bavaria', E'Berlin', E'Brandenburg']"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-macro-register-sql-operators" class="outline-3">
<h3 id="macro-register-sql-operators">macro register-sql-operators (arity &amp;rest names)</h3>
<div class="outline-text-3" id="text-macro-register-sql-operators">
<p>
Define simple operators. Arity is one of :unary (like
'not'), :unary-postfix (the operator comes after the operand),
:n-ary (like \+ : the operator falls away when there is only one
operand), :2+-ary (like '=', which is meaningless for one operand),
or :n-or-unary (like '-', where the operator is kept in the unary
case). After the arity follow any number of operators, either just a
keyword, in which case the downcased symbol name is used as the
operator, or a two-element list containing a keyword and a name
string.
</p>
</div>
</div>
