doc/postmodern.org
** variable =*escape-sql-names-p*=
   :PROPERTIES:
   :CUSTOM_ID: variable-escape-sql-names-p
   :END:

Determines whether double quotes are added around column, table, and function
names in queries. Valid values:

- T, in which case every name is escaped,
- NIL, in which case no name is escape,
- :auto, which causes only [[http://www.postgresql.org/docs/current/static/sql-keywords-appendix.html][reserved words]] to be escaped, or.
- :literal which is the same as :auto except it has added consequence in
to-sql-name (see below).

The default value is :auto.

Be careful when binding this with let and such ― since a lot of SQL compilation
tends to happen at compile-time, the result might not be what you expect. Mixed
case sensitivity is not currently well supported. Postgresql itself will
downcase unquoted identifiers. This will be revisited in the future if requested.

** function to-sql-name (name &optional (escape-p =*escape-sql-names-p*=) (ignore-reserved-words nil))
   :PROPERTIES:
   :CUSTOM_ID: function-to-sql-name
   :END:

Convert a symbol or string into a name that can be a sql table, column, or
operation name. Add quotes when escape-p is true, or escape-p is :auto and the
name contains reserved words. Quoted or delimited identifiers can be used by
passing :literal as the value of escape-p. If escape-p is :literal, and the
name is a string then the string is still escaped but the symbol or string is
not downcased, regardless of the setting for =*downcase-symbols*= and the hyphen
and forward slash characters are not replaced with underscores.

Ignore-reserved-words is only used internally for column names which are allowed
to be reserved words, but it is not recommended.

** condition sql-error
   :PROPERTIES:
   :CUSTOM_ID: condition-sql-error
   :END:
        No documentation provided.


* Conditions Imported From cl-postgres
  :PROPERTIES:
  :CUSTOM_ID: conditions-imported-from-cl-postgres
  :END:
** condition database-connection-error
   :PROPERTIES:
   :CUSTOM_ID: condition-database-connection-error
   :END:

Conditions of this type are signalled when an error occurs that breaks the
connection socket. They offer a :reconnect restart.

** condition database-error
   :PROPERTIES:
   :CUSTOM_ID: condition-database-error
   :END:

This is the condition type that will be used to signal virtually all
database-related errors (though in some cases socket errors may be raised when
a connection fails on the IP level).
*** reader database-error-code
    :PROPERTIES:
    :CUSTOM_ID: reader-database-error-code
    :END:

Code: the Postgresql SQLSTATE code for the error
 (see the Postgresql Manual Appendix A for their meaning). Not localizable.
 Always present.

*** accessor database-error-message
    :PROPERTIES:
    :CUSTOM_ID: accessor-database-error-code
    :END:

Message: the primary human-readable error message. This should be accurate
but terse (typically one line). Always present.

*** reader database-error-detail
    :PROPERTIES:
    :CUSTOM_ID: reader-database-error-detail
    :END:

Detail: an optional secondary error message carrying
more detail about the problem. Might run to multiple lines or NIL if none is
available.

*** reader database-error-query
    :PROPERTIES:
    :CUSTOM_ID: reader-database-error-query
    :END:
Query that led to the error, or NIL if no query was involved.

*** reader database-error-cause
    :PROPERTIES:
    :CUSTOM_ID: reader-database-error-cause
    :END:
The condition that caused this error, or NIL when it was not caused by another condition.

** function database-error-constraint-name (err)
   :PROPERTIES:
   :CUSTOM_ID: function-database-error-constraint-name
   :END:

Given a database-error for an integrity violation, will attempt to
extract the constraint name.

** function database-error-extract-name (err)
   :PROPERTIES:
   :CUSTOM_ID: function-database-error-extract-name
   :END:

Given a database-error, will extract the critical name from the error message.
