doc/postmodern.html
<div id="outline-container-variable-escape-sql-names-p" class="outline-3">
<h3 id="variable-escape-sql-names-p">variable <code>*escape-sql-names-p*</code></h3>
<div class="outline-text-3" id="text-variable-escape-sql-names-p">
<p>
Determines whether double quotes are added around column, table, and function
names in queries. Valid values:
</p>

<ul class="org-ul">
<li>T, in which case every name is escaped,</li>
<li>NIL, in which case no name is escape,</li>
<li>:auto, which causes only <a href="http://www.postgresql.org/docs/current/static/sql-keywords-appendix.html">reserved words</a> to be escaped, or.</li>
<li>:literal which is the same as :auto except it has added consequence in</li>
</ul>
<p>
to-sql-name (see below).
</p>

<p>
The default value is :auto.
</p>

<p>
Be careful when binding this with let and such ― since a lot of SQL compilation
tends to happen at compile-time, the result might not be what you expect. Mixed
case sensitivity is not currently well supported. Postgresql itself will
downcase unquoted identifiers. This will be revisited in the future if requested.
</p>
</div>
</div>

<div id="outline-container-function-to-sql-name" class="outline-3">
<h3 id="function-to-sql-name">function to-sql-name (name &amp;optional (escape-p <code>*escape-sql-names-p*</code>) (ignore-reserved-words nil))</h3>
<div class="outline-text-3" id="text-function-to-sql-name">
<p>
Convert a symbol or string into a name that can be a sql table, column, or
operation name. Add quotes when escape-p is true, or escape-p is :auto and the
name contains reserved words. Quoted or delimited identifiers can be used by
passing :literal as the value of escape-p. If escape-p is :literal, and the
name is a string then the string is still escaped but the symbol or string is
not downcased, regardless of the setting for <code>*downcase-symbols*</code> and the hyphen
and forward slash characters are not replaced with underscores.
</p>

<p>
Ignore-reserved-words is only used internally for column names which are allowed
to be reserved words, but it is not recommended.
</p>
</div>
</div>

<div id="outline-container-condition-sql-error" class="outline-3">
<h3 id="condition-sql-error">condition sql-error</h3>
<div class="outline-text-3" id="text-condition-sql-error">
<p>
No documentation provided.
</p>
</div>
</div>
</div>


<div id="outline-container-conditions-imported-from-cl-postgres" class="outline-2">
<h2 id="conditions-imported-from-cl-postgres">Conditions Imported From cl-postgres</h2>
<div class="outline-text-2" id="text-conditions-imported-from-cl-postgres">
</div>
<div id="outline-container-condition-database-connection-error" class="outline-3">
<h3 id="condition-database-connection-error">condition database-connection-error</h3>
<div class="outline-text-3" id="text-condition-database-connection-error">
<p>
Conditions of this type are signalled when an error occurs that breaks the
connection socket. They offer a :reconnect restart.
</p>
</div>
</div>

<div id="outline-container-condition-database-error" class="outline-3">
<h3 id="condition-database-error">condition database-error</h3>
<div class="outline-text-3" id="text-condition-database-error">
<p>
This is the condition type that will be used to signal virtually all
database-related errors (though in some cases socket errors may be raised when
a connection fails on the IP level).
</p>
</div>
<div id="outline-container-reader-database-error-code" class="outline-4">
<h4 id="reader-database-error-code">reader database-error-code</h4>
<div class="outline-text-4" id="text-reader-database-error-code">
<p>
Code: the Postgresql SQLSTATE code for the error
 (see the Postgresql Manual Appendix A for their meaning). Not localizable.
 Always present.
</p>
</div>
</div>

<div id="outline-container-accessor-database-error-code" class="outline-4">
<h4 id="accessor-database-error-code">accessor database-error-message</h4>
<div class="outline-text-4" id="text-accessor-database-error-code">
<p>
Message: the primary human-readable error message. This should be accurate
but terse (typically one line). Always present.
</p>
</div>
</div>

<div id="outline-container-reader-database-error-detail" class="outline-4">
<h4 id="reader-database-error-detail">reader database-error-detail</h4>
<div class="outline-text-4" id="text-reader-database-error-detail">
<p>
Detail: an optional secondary error message carrying
more detail about the problem. Might run to multiple lines or NIL if none is
available.
</p>
</div>
</div>

<div id="outline-container-reader-database-error-query" class="outline-4">
<h4 id="reader-database-error-query">reader database-error-query</h4>
<div class="outline-text-4" id="text-reader-database-error-query">
<p>
Query that led to the error, or NIL if no query was involved.
</p>
</div>
</div>

<div id="outline-container-reader-database-error-cause" class="outline-4">
<h4 id="reader-database-error-cause">reader database-error-cause</h4>
<div class="outline-text-4" id="text-reader-database-error-cause">
<p>
The condition that caused this error, or NIL when it was not caused by another condition.
</p>
</div>
</div>
</div>

<div id="outline-container-function-database-error-constraint-name" class="outline-3">
<h3 id="function-database-error-constraint-name">function database-error-constraint-name (err)</h3>
<div class="outline-text-3" id="text-function-database-error-constraint-name">
<p>
Given a database-error for an integrity violation, will attempt to
extract the constraint name.
</p>
</div>
</div>

<div id="outline-container-function-database-error-extract-name" class="outline-3">
<h3 id="function-database-error-extract-name">function database-error-extract-name (err)</h3>
<div class="outline-text-3" id="text-function-database-error-extract-name">
<p>
Given a database-error, will extract the critical name from the error message.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
